{
  "seen_posts": {
    "1mxa6j7": "2025-08-23T17:12:51.791100",
    "1mxbj1u": "2025-08-23T17:12:51.791100",
    "1muegll": "2025-08-23T17:12:51.791100",
    "1my62nk": "2025-08-23T17:12:51.791100",
    "1mwqph9": "2025-08-23T17:12:51.791100",
    "1my34rr": "2025-08-23T17:12:51.791100",
    "1mx6ah9": "2025-08-23T17:12:51.791100",
    "1mxvwqz": "2025-08-23T17:12:51.791100",
    "1my3k7p": "2025-08-23T17:12:51.791100",
    "1mxe1ej": "2025-08-23T17:12:51.791100",
    "1mxnii5": "2025-08-23T17:12:51.791100",
    "1mxhuqt": "2025-08-23T17:12:51.791100",
    "1mxl1i3": "2025-08-23T17:12:51.791100",
    "1mxyqrq": "2025-08-23T17:12:51.791100",
    "1mxzksq": "2025-08-23T17:12:51.791100",
    "1muiuig": "2025-08-23T17:12:51.791100",
    "1mwxiyr": "2025-08-23T17:12:51.791100",
    "1mxxlbe": "2025-08-23T17:12:51.791100",
    "1mxh75t": "2025-08-23T17:12:51.791100",
    "1mx925s": "2025-08-23T17:12:51.791100",
    "1mx1k1t": "2025-08-23T17:12:51.791100",
    "1mwxbxg": "2025-08-23T17:12:51.791100",
    "1mxxwsw": "2025-08-23T17:12:51.791100",
    "1mptiyv": "2025-08-23T17:12:51.791100",
    "1mww1n1": "2025-08-23T17:12:51.791100",
    "1my00ad": "2025-08-23T17:12:51.791100",
    "1mx3ewm": "2025-08-23T17:12:51.791100",
    "1mx5h1d": "2025-08-23T17:12:51.791100",
    "1mx2tad": "2025-08-23T17:12:51.791100",
    "1mwt3h0": "2025-08-23T17:12:51.791100",
    "1mxyoml": "2025-08-23T17:12:51.791100",
    "1mxywey": "2025-08-23T17:12:51.791100",
    "1mwpv9u": "2025-08-23T17:12:51.791100",
    "1mx0ye7": "2025-08-23T17:12:51.791100",
    "1mwsrbj": "2025-08-23T17:12:51.791100",
    "1mrtlk5": "2025-08-23T17:12:51.791100",
    "1mxsjjh": "2025-08-23T17:12:51.791100",
    "1mmstyr": "2025-08-23T17:12:51.791100",
    "1mxve5w": "2025-08-23T17:12:51.791100",
    "1mwnv1t": "2025-08-23T17:12:51.791100",
    "1mwdzqj": "2025-08-23T17:12:51.791100",
    "1mxozzf": "2025-08-23T17:12:51.791100",
    "1mwmhag": "2025-08-23T17:12:51.791100",
    "1my5r3y": "2025-08-23T17:12:51.791100",
    "1mx8xdt": "2025-08-23T17:12:51.791100",
    "1mxvz2c": "2025-08-23T17:12:51.791100",
    "1mxhsov": "2025-08-23T17:12:51.791100",
    "1mmkykr": "2025-08-23T17:12:51.791100",
    "1my0b3v": "2025-08-23T17:12:51.791100",
    "1my1bf2": "2025-08-23T17:12:51.791100",
    "1mxrf64": "2025-08-23T17:12:51.791100",
    "1mxywel": "2025-08-23T17:12:51.791100",
    "1mxybwa": "2025-08-23T17:12:51.791100",
    "1mxcshm": "2025-08-23T17:12:51.791100",
    "1my5unp": "2025-08-23T17:12:51.791100",
    "1mwoufm": "2025-08-23T17:12:51.791100",
    "1mn6egs": "2025-08-23T17:12:51.791100",
    "1mxdx4j": "2025-08-23T17:12:51.791100",
    "1mx50fu": "2025-08-23T17:12:51.791100",
    "1my0aqj": "2025-08-23T17:12:51.791100",
    "1mx4por": "2025-08-23T17:12:51.791100",
    "1muipkp": "2025-08-23T17:12:51.791100",
    "1mx156f": "2025-08-23T17:12:51.791100",
    "1mxfv69": "2025-08-23T17:12:51.791100",
    "1mwmt93": "2025-08-23T17:12:51.791100",
    "1mxzgrc": "2025-08-23T17:12:51.791100",
    "1mxy384": "2025-08-23T17:12:51.791100",
    "1mp39ps": "2025-08-23T17:12:51.791100",
    "1mwslej": "2025-08-23T17:12:51.791100",
    "1mohb01": "2025-08-23T17:12:51.791100",
    "1my8jon": "2025-08-23T18:20:55.927633",
    "1mya2jx": "2025-08-23T19:12:05.903819",
    "1myc3u8": "2025-08-23T20:38:11.743619",
    "1myde3o": "2025-08-23T21:28:35.295151",
    "1myb120": "2025-08-23T22:14:55.567992",
    "1myf8tq": "2025-08-23T22:49:48.149870",
    "1myjsmf": "2025-08-24T03:06:09.170159",
    "1myjnqt": "2025-08-24T03:06:09.170213",
    "1myn2cw": "2025-08-24T05:16:24.771755",
    "1mymsfc": "2025-08-24T05:16:24.772007",
    "1myqtdz": "{\"text\": \"Books for sale Bundle of books I'm finished with and looking to get rid of.\\n\\u00a320\\n25 books in total.\\nPick up Anniesland/Knightswood \", \"author\": \"sunshinedeadhead\", \"timestamp\": \"2025-08-24T09:15:36.916539\"}",
    "1myshcp": "{\"text\": \"Live music - today Does anyone know of places that have music on this afternoon? \", \"author\": \"1514RobbieDye\", \"timestamp\": \"2025-08-24T11:12:36.877321\"}",
    "1myuc88": "{\"text\": \"Any advice for terrible neighbours. I recently moved to the Firhill area, and my upstairs neighbours are driving me fucking insane. From  10 AM until as late as 5 AM, they\\u2019re constantly blasting music. I\\u2019ve tried speaking to them, but they won\\u2019t even open the door. I\\u2019ve spoken to my landlord, and his only suggestion was to call the police \\u2014 but I don\\u2019t want to escalate it that quickly. Does anyone have any advice on how to get them to shut up?\", \"author\": \"Hiccupping_Raven\", \"timestamp\": \"2025-08-24T12:31:39.721327\"}",
    "1myue27": "{\"text\": \"Yellow walkers I\\u2019m currently seeing lots of people in yellow walking past Kelvingrove art gallery from my window\\u2026 just being nosey and wondering if anyone knows what\\u2019s going on \\ud83d\\ude02\", \"author\": \"Budget_Twist_2767\", \"timestamp\": \"2025-08-24T13:07:01.340574\"}",
    "1myvbp1": "{\"text\": \"Shipping parcels to EU I am moving to Paris, so I though I would post some of my belongings (mostly clothes, shoes and personal items) rather than carrying everything. Which provider would you suggest that are cheaper and easy to use? I do not care about the fast service. Also, do I need to complete a customs declaration or some documents even if it's not for sale? some of the website ask for detailed description of every item.\\n\\nThanks\", \"author\": \"Pure_Leather_3396\", \"timestamp\": \"2025-08-24T13:34:11.809527\"}",
    "1myvu2r": "{\"text\": \"Council tax So it\\u2019s South Lanarkshire council that charge me. I seem to\\nBe overpaying and have been for a while. I am\\nBeing charged more than even the highest bracket in my area so there\\u2019s really no rhyme or reason that it should be as much. I\\u2019m really annoyed at this as I have been under a lot of strain financially and this has made it worse of course.  I have also asked about it before but been fobbed off. So my question is what or who should I contact in the council for a quick and fair review of this. And has anyone had similar and what was the outcome. \\nThanks. \", \"author\": \"amandathepanda51\", \"timestamp\": \"2025-08-24T13:49:50.293015\"}",
    "1mywvh6": "{\"text\": \"saw this in bell street and wtf was just passing by w a friend and it was so damn smelly. can't help but cover my nose. anyone know what this is? \", \"author\": \"yumenogarden\", \"timestamp\": \"2025-08-24T14:31:49.865302\"}",
    "1myxfv6": "{\"text\": \"Making pals I\\u2019m a 21 year old female, I stay like half hour/40 mins outside of Glasgow and I want to meet some pals, I never done uni or anything so didn\\u2019t get a chance to make mates that way. I have a group of pals that I\\u2019m close with but I feel I want to live life a bit more than they do!! aka go out, book holidays and go to raves \\ud83e\\udd23 if anyone is similar minded to me drop me a message or if anyone knows any like groups or anything please let me know! I feel like a bit of a loser posting this lol but promise I\\u2019m normal \\ud83e\\udd23\", \"author\": \"Legal_Nefariousness7\", \"timestamp\": \"2025-08-24T14:49:33.816769\"}",
    "1myxd4x": "{\"text\": \"Me taking pictures of Glasgow\\u2019s Vintage Bus Day last year \\n\\n\\ud83d\\ude8c Any vintage transport lovers here? \\n\\nAfter living in Glasgow for a whole year, I thought I\\u2019d seen it all: the art, the music, the museums\\u2026 but then I stumbled upon the Glasgow Vintage Bus Day\\u2014 and honestly? It completely stole my heart. \\ud83d\\udc98\\n\\nThere\\u2019s something magical about seeing these beautifully preserved buses\\u2014from the '50s right through to the '90s\\u2014rolling through the city streets today.\\n\\nAs a photography lover, these might be the best shots I\\u2019ve ever taken in Glasgow. Shooting this event gave me the vibe of watching a city gently rewind time. The buses don\\u2019t feel like museum pieces\\u2014they feel alive, and they belong, elegantly matching the vibe of Glasgow\\u2019s beautiful architecture.\\n\\n\\u2728 Highlights:  \\nThese beautifully preserved historical vehicles are maintained and displayed by the **Glasgow Vintage Vehicle Trust (GVVT)**. Anyone who is interested is free to explore more on their official website:  \\ud83d\\udc47\\n\\ud83d\\udd17 https://gvvt.org/visiting-us\", \"author\": \"EntertainerJolly8982\", \"timestamp\": \"2025-08-24T14:49:33.909268\"}",
    "1myzkiw": "{\"text\": \"New Diamond chinese My closest Chinese takeaway is the New Diamond on McNeil Street, I've used them since they opened last year, never had a problem. \\n\\nOn Friday, I placed an order on their website, all went through, but it never came. After 90 minutes, I walked over and saw the shutter was down and they were closed! I then went on deliveroo to see if they were taking orders there but they weren't.\\n\\nThey're still closed today, and the phone hasn't been answered, any one have any suggestions how to get my money back?\", \"author\": \"Swimming-Pirate-2458\", \"timestamp\": \"2025-08-24T16:18:52.444697\"}",
    "1mz1pry": "{\"text\": \"Why is this terrace so cheap? [4 bedroom terraced house for sale in Dowanside Road, Dowanhill, Glasgow, G12](https://www.rightmove.co.uk/properties/163308365#/?channel=RES_BUY)\\n\\n  \\nSorry but I was browsing for houses I could never afford as u do and saw this was only 855k? The inside is insane. Are they normally this cheap or is there something I should know?\", \"author\": \"Queasy_Champion_681\", \"timestamp\": \"2025-08-24T17:30:12.468769\"}",
    "1mz1zm4": "{\"text\": \"Migraines Odd question.  Has anyone experienced a huge ramp up in the number of migraines they have over the past few weeks.  I have migraines that are weather dependant. High fluctuations in atmospheric pressure.  Checking if it has just been really terrible weather of late or is my brain broken.\", \"author\": \"Rogertron88\", \"timestamp\": \"2025-08-24T17:42:09.262571\"}",
    "1mz2ww7": "{\"text\": \"Glasglow Never attended it\\u2019son \\u2018Glasglow\\u2019 looking for any tips for on the day with a 1 year old. Is there parking close by as one of our group is disabled and has a blue badge? \", \"author\": \"Cold_Day17\", \"timestamp\": \"2025-08-24T18:21:36.519866\"}",
    "1mz3q96": "{\"text\": \"Chinese restaurants fly tipping Honestly sick of the amount of fly tipping coming from the restaurants around me. During the week, there were 12 black bags left lying in the bin store, along without about 10 cardboard boxes. Making it worse, the bins were predominantly empty so could have at least been disposed of.  Worse again, was the fact tonnes of it was food and that was on the ground due to the seagulls, rats enjoying their free meals. \\n\\nToday when trying to give the bin store a tidy up, the smell was rotten and actually nearly made be add to the mess! When you do catch the guys, it's great, but they like to appear in the early hours now and you can't just stay up to catch them. Anyone else having the same issues, and any thoughts/actions what to do? Bin stores are in our car park and I have one of the larger stores, so always the targeted one.\\n\\nI'm G4 area, so maybe you have the same issues where you are!\", \"author\": \"Overall-Bar-2939\", \"timestamp\": \"2025-08-24T18:45:36.211256\"}",
    "1mz4rtm": "{\"text\": \"Dropped my earphones somewhere in the city centre, would appreciate if anyone finds them. Hi, I was riding around on my bike and my earphones case slipped out my pocket. I know it doesn't cost too much for a replacement but I'd rather just wait.  would really appreciate if anyone has seen them and picks them up.\", \"author\": \"Pitiful_Storage_8069\", \"timestamp\": \"2025-08-24T19:25:26.930621\"}",
    "1mz4mh4": "{\"text\": \"A Glasgow icon And a can of Bru\", \"author\": \"shakingandwithdrawn\", \"timestamp\": \"2025-08-24T19:25:26.994401\"}",
    "1mz51jw": "{\"text\": \"Anyone know of any lockups going? Hey folks\\n\\nI'm in need of a lockup, mainly for storage, little bit for doing work in (fiddling with a classic car, storing my stuff well I move house). \\n\\nCan't for the life of me find anything other than self store places, does anyone know of anything going, preferably in the west (I'm between Inverclyde & North Ayrshire currently). \", \"author\": \"CAElite\", \"timestamp\": \"2025-08-24T19:36:43.584538\"}",
    "1mz1n72": "{\"text\": \"Internal soil stack replacement recommendations Old tenement problems\\u2026 anyone had an internal stack replaced? Needing some recommendations for a good plumber. Seems pretty difficult to find anyone willing to do this. \", \"author\": \"Sorry_Shake_9372\", \"timestamp\": \"2025-08-24T19:49:25.412451\"}",
    "1mz5g8g": "{\"text\": \"Filming on Cochrane Street yesterday Does anyone know what was being filmed down there yesterday? They had created a NYC street but were keeping very tight-lipped about what they were filming. \\n\\nOn an earlier post someone mentioned Spiderman 4 was being filmed in Glasgow, but that was about a week ago I think.\", \"author\": \"MLC1974\", \"timestamp\": \"2025-08-24T19:49:25.544311\"}",
    "1mz5yj1": "{\"text\": \"Photographer I'm looking for a photographer from Glasgow or nearby who could do an outdoor couple photoshoot. Do you recommend anyone?\", \"author\": \"forestxxfae\", \"timestamp\": \"2025-08-24T20:17:23.163362\"}",
    "1mz5mj7": "{\"text\": \"Junk left by previous tenants Need some advice on how to properly deal with this\\n\\nI live in a building with 4 flats, I own mine and the other three are private rents\\n\\nIn the building we have a communal room with no obvious use\\nI think it used to be a flat in the past but has been gutted for some reason\\n\\nMy issue is that the room is completely filled wall to wall with junk \\nOld mattresses, bags of clothes, old suitcases, broken and dismantled ikea furniture, tins of paint, a massage table and a small tank of butane \\n\\nEverything in there has been dumped by previous tenants who have moved out \\n\\nThis room is directly located under my flat and it goes without saying I\\u2019m nervous about it potentially being a fire hazard given what\\u2019s inside it\\n\\nI\\u2019m in a group chat with the landlords of the building and sent pictures of the junk and spoke to them about getting everything removed as I\\u2019d like to make some repairs to that room as it makes my flat freezing cold in the winter\\n\\nIt\\u2019s been a month now since I\\u2019ve had any response even after some of them saying they would come and remove their previous tenants stuff\\n\\nOn top of that one of the landlords has taken up the entire shared roof terrace with their flowerbeds and vegetable plots which have been left to rot and be overgrown with weeds\\nThey have an old bath that was used as a water butt and is now just filled with stagnant brown water.\\nThere also three wheelie bins converted into compost bins that are just completely stinking and swarming with flies\\nNot to mention all the gardening supplies and bags of fertiliser stored next to this junk room \\n\\nI\\u2019m pretty unhappy with all this as I couldn\\u2019t make much use of the terrace when the weathers been good and I\\u2019m constantly nervous about that room catching fire as someone has been smoking in the stairwell and the hallway outside that room\\n\\nWho exactly could I go to, to get help with this?\\nCould I face any sort of legal trouble for just going ahead and removing this stuff myself?\\nEven though it\\u2019s been left behind someone at work since it\\u2019s not my property I could be accused of stealing \\nThe landlords in the building were completely disinterested and were just stand offish and rude when I spoke to them so I\\u2019m just done dealing with them\\n\\nI\\u2019ve been told the environmental health department of Renfrewshire council could get involved and someone even suggested speaking to my local MSP but I honestly don\\u2019t know where to begin and would prefer to get this dealt with as quickly as possible \\n\\nAny idea would be appreciated thanks \\n\", \"author\": \"Craigermeister69\", \"timestamp\": \"2025-08-24T20:17:23.228393\"}",
    "1mz67vt": "{\"text\": \"Stride Athletics Urban Orienteering - Wednesday 27 August Urban orienteering in Kelvingrove from 6pm. Registration at Inn Deep.\\n\\nLink: https://www.eventbrite.com/e/stride-athletics-glasgow-urban-orienteering-2-tickets-1503859958619?aff=erelexpmlt&_gl=1*6m5crj*_up*MQ..*_ga*NDkxMjY3MjM2LjE3NTYwNjYwMjY.*_ga_TQVES5V6SH*czE3NTYwNjYwMjUkbzEkZzAkdDE3NTYwNjYwMjUkajYwJGwwJGgw\", \"author\": \"MickIAC\", \"timestamp\": \"2025-08-24T20:17:24.381381\"}",
    "1mz6fab": "{\"text\": \"No lights, no helmet, no clue \", \"author\": \"UmpireOne357\", \"timestamp\": \"2025-08-24T20:38:58.380120\"}",
    "1mz7es5": "{\"text\": \"Lost Dog Near Knightswood Hey, this little guy was outside our house just now and no one nearby knows who\\u2019s dog it is. If anyone is missing a small white male dog please message me. \", \"author\": \"connor03_\", \"timestamp\": \"2025-08-24T21:40:56.036124\"}",
    "1mz968m": "{\"text\": \"Anniesland versus Kilbride Hi all\\nMy husband and I are planning to move to Glasgow together. He already lives there and I\\u2019m moving with him but he\\u2019s a bit clueless about areas in Glasgow because he spends 99% of his time at work\\ud83d\\ude02. We\\u2019ve found two apartments:\\n1 bed in Anniesland, near to transport and grocery shops. 2 bed in Kilbride, a bit further from transport and grocery shops. \\n\\nWhich area would you recommend for us? \", \"author\": \"Confusedbrownwoman\", \"timestamp\": \"2025-08-24T22:15:36.093611\"}",
    "1mz9toj": "{\"text\": \"distraught!! just heard that the marks and spencer\\u2019s on byres road is closing this october and i am actually distraught. it\\u2019s always packed as well so i don\\u2019t get why they\\u2019d close it?? have no idea how im going to survive uni without having it so close by :((( \\n\\nedit: ok so apparently the uni is going to put in a plan to make student accommodation. GIVE ME A BREAK\", \"author\": \"Business_Abroad_31\", \"timestamp\": \"2025-08-24T22:49:23.732785\"}",
    "1mzb1c1": "{\"text\": \"Question about Citylink buses? I'm thinking about a trip from the US to Glasgow in October, but it's substantially easier for me to fly to Edinburgh rather than Glasgow airport because of costs, flight connections, etc.\\n\\nI see there is a Citylink bus service that appears to go from the airport right into Glasgow. I'm wondering how reliable this service is? I'm planning on attending the Scotland-Belarus match in Glasgow on the night of Sunday the 12th, and would likely be flying out the next morning so I'm just hoping I could plan on getting the bus from Glasgow in the morning to the airport without an issue. The flight out would be just before noon.\", \"author\": \"E51838\", \"timestamp\": \"2025-08-24T23:37:46.042983\"}",
    "1mzcvkd": "{\"text\": \"Attempted mugging Finnieston Some wee bams tried to mug me for my camera earlier this evening. I was getting a couple of beers in GG Bros and they bouled in, asking the owner daft questions about what he had in stock, wee guy comes right up to me and starts with the classic lines of, 'that's a nice camera', 'how much is it worth?' then starts to poke at it. He's taking the piss and I know what's coming next. As I leave, he follows me with some aggro chat, while also grabbing at his hoodie pocket like he has a knife so I turn to him and scream, \\\"GET THE FUCK AWAY FROM ME, NOW!\\\" I went full rozzer! He backs off but re-groups with his 4 or 5 pals. I had to get a taxi out of the area. I'd expect this kind of shit in Naples or parts of London but not Glasgow. Never thought I'd say this but the rozzers need to up their game. I've lived in Glasgow 34 years and never seen such brazen cheek!\", \"author\": \"Mr_Bear12345_6\", \"timestamp\": \"2025-08-25T01:20:53.271652\"}",
    "1mzhlol": "{\"text\": \"The Steamie - Monday 25 August 2025 **Travel**\\n\\n\\n\\nCancellations to services between Glasgow Central and East Kilbride\\n\\nDue to engineering works not being finished on time between Glasgow Central and Crossmyloof disruption is expected until 09:00 25/08.\\n\\nTrain services between Glasgow Central and East Kilbride may be cancelled, delayed or revised.\\n\\nOption 1 - Check if a rail journey is currently possible..\\n\\n* Use the National Rail Enquiries real-time journey planner to check if you can continue your journey by rail.\\n\\nOption 2 - Alternative Routes & Local Public Transport..\\n\\n* Please check alternative walking routes for services via Pollokshields West and Crossmyloof.\\n\\n* Please check alternative walking routes for services via Neilston and East Kilbride.\\n\\n* If you have had to drive to another station your ticket will be valid to collect your car on your return journey. Speak to a member of staff to validate your ticket.\\n\\n* Currently, we have not arranged for your rail tickets to be accepted on local bus routes as yet. We will monitor this situation as the incident develops.\\n\\nOption 3 - Rail Replacement Transport..\\n\\n* Currently, we have not requested Rail Replacement Transport. We will monitor this situation as the incident develops.\\n\\nOption 4 - Consider travelling later..\\n\\n* You might wish to consider postponing your journey until our service's return to normal.\\n\\nNetwork Rail have advised that engeineering operations in the Muirhouse area are currently over-running which is affecting our train services.\\n\\nStaff are working hard to get the works finished and to get all lines reopened with a current estimate of trains being able to operate at 0700.\\n\\nAlterations have been made to some early morning services. Please check your journey before you leave for the station.\\n\\nLet us help you:Please let us try and help you if you are being disrupted. At the station or on-train:* Speak to a member of staff or use the Help-point (station only).* Listen for announcements.* Information will be displayed on Customer Information Screens.Keep up to date or get in touch on your phone:Twitter:  Live updates @ScotRail.WhatsApp:  Contact us on WhatsApp.App:  Live updates on our app. Phone:  Contact Customer Relations.\\n\\nCancellations to services between Glasgow Central and Barrhead\\n\\nTrain services between Glasgow Central and Barrhead may be cancelled, delayed or revised.\\n\\nCustomers can travel on alternative routes.\\n\\n* Local services between Glasgow Central and Kilmarnock/Barrhead.\\n\\nCancellations to services between Glasgow Central and Kilmarnock\\n\\nTrain services between Glasgow Central and Kilmarnock may be cancelled, delayed or revised.\\n\\nCancellations to services between Glasgow Central and Neilston\\n\\nTrain services between Glasgow Central and Neilston may be cancelled, delayed or revised.\\n\\n* Glasgow Central - Newton for stations between Glasgow Central & Cathcart\\n\\n* Glasgow Central - Neilston for stations between Glasgow Central & Cathcart\\n\\nCancellations to services between Glasgow Central and Newton Lanark via Kings Park\\n\\nTrain services between Glasgow Central and Newton Lanark via Kings Park may be cancelled, delayed or revised.\\n\\nCancellations to services between Glasgow Central and Glasgow Central via Queens Park Strathclyde\\n\\nTrain services between Glasgow Central and Glasgow Central via Queens Park Strathclyde will be cancelled.\\n\\nTrain services between Glasgow Central and Glasgow Central via Maxwell Park will be revised.\\n\\n**Today in Scottish History**\\n\\n25 August 1819: The birth in Glasgow   of Allan Pinkerton, who would go on to  found  the Pinkerton Detective Agency in the United States.\\n\\n**/r/GlasgowMarket Digest**\\n\\n[Stride Athletics Urban Orienteering - Wednesday 27 August](/r/glasgowmarket/comments/1mz67vt/stride_athletics_urban_orienteering_wednesday_27/)\\n\\n[Books for sale](/r/glasgowmarket/comments/1myqtdz/books_for_sale/)\\n\\n[Anyone selling 2-3 esdee kid tickets for the 19th, can pay abit above also must provide legit proof of the tickets!](/r/glasgowmarket/comments/1mxbj1u/anyone_selling_23_esdee_kid_tickets_for_the_19th/)\\n\\n[2 VIP Tickets to Beluga Lagoon in Kelso with VIP Parking pass](/r/glasgowmarket/comments/1mwt3h0/2_vip_tickets_to_beluga_lagoon_in_kelso_with_vip/)\\n\\n[Looking for Alchemised Signing Ticket in Glasgow](/r/glasgowmarket/comments/1muiuig/looking_for_alchemised_signing_ticket_in_glasgow/)\\n\\n[New mechanic business Glasgow](/r/glasgowmarket/comments/1muipkp/new_mechanic_business_glasgow/)\\n\\n[boozy brunch tickets for sale](/r/glasgowmarket/comments/1muegll/boozy_brunch_tickets_for_sale/)\\n\\n**Tune of the day**\\n\\n[Let 3 - Mama \\u0160\\u010c! (LIVE) | Croatia \\ud83c\\udded\\ud83c\\uddf7 | Grand Final | Eurovision 2023](https://youtu.be/hGuGfdEJ5Pw) (suggested by /u/Queasy-Ice-2575) \\n\\nPicked from 3 eligible links submitted today. [Suggest tomorrow's tune](https://www.reddit.com/message/compose/?to=SteamieBot&subject=SongRequest&message=YouTube link here).\", \"author\": \"SteamieBot\", \"timestamp\": \"2025-08-25T05:18:08.136087\"}",
    "1mzjqwk": "{\"text\": \"Traditional Tattoo Anyone know of any artists that are good for traditional style tattoos? \", \"author\": \"Honey_Yoghurt99\", \"timestamp\": \"2025-08-25T07:17:34.104390\"}",
    "1mzkkbo": "{\"text\": \"Butcher\\u2019s steak pie recommendations Just learned that W Bishop butchers shut back in May! Gutted as they had the best steak pies around. Can anyone offer alternatives? TIA. \", \"author\": \"NSteel83\", \"timestamp\": \"2025-08-25T08:24:49.769768\"}",
    "1mzlkam": "{\"text\": \"Renting in Glasgow Hello!\\n\\nI\\u2019ve just moved back to Fife with my mum for a wee bit but planning on moving to Glasgow by the end of the year/new year with my partner, but increasingly worried about how difficult it\\u2019s been for friends who are trying to move to Glasgow/Edinburgh this September. I have a couple of questions I was wondering if yous could help me out with!\\n\\nI\\u2019ve got a good credit score, have lived in the same rented property from July 2018 till now, I am on PIP and limited capacity for work related activity which provides rent but I work freelance as well, I don\\u2019t have any savings lol but do have a UK guarantor! I\\u2019ve lived in the UK since I was 18 and paid rent reliably since then independently (I am a British citizen if that makes a difference in being easier for me to rent although it Shouldn\\u2019t \\ud83e\\udd28)\\nI\\u2019m looking for somewhere unfurnished in the southside and I also have a cat to add another complication with renting to the mix \\ud83d\\ude05\\n\\n1) Does there seem to be a difference in the craziness of applying for housing in the summer and the winter? My pals were saying like 20/30 ppl were applying for each house they were going for which feels nuts (but I guess makes sense as students looking at that time).\\n\\n2) Do you legally have to disclose if you are on benefits? I\\u2019m on PIP and Limited Capacity to Work but sometimes I do work freelance so technically my income is 24k\\u2026 but I\\u2019ve heard landlords are not favourable to rent with people with benefits so I\\u2019m hesitant to disclose it at all? They\\u2019ll be getting the money either way so\\u2026 \\n\\n3) any tips on how best to navigate the rental market would be great and also any letting agents to avoid like the plague?to \\n\\nThank you so much in advance! \", \"author\": \"vespertinefan\", \"timestamp\": \"2025-08-25T09:19:13.045592\"}",
    "1mzm5kt": "{\"text\": \"Maths tutoring - how much to charge? I\\u2019m 22 years old and just recently graduated with BSc Hons in Maths. I have very little classroom experience (part of my dissertation topic was around teaching maths and I visited a school in Glasgow and \\u2019taught\\u2019 a few lessons, except for that nothing else). How much would be fair per hour for teaching National 5 Maths in Glasgow?\", \"author\": \"Own-Syllabub-4848\", \"timestamp\": \"2025-08-25T09:51:32.549683\"}",
    "1mzkq13": "{\"text\": \"Dog shelters in Glasgow that would let me walk dogs as a volunteer? Pretty much as the title says. My dog passed over a 1yr ago now and I feel lost without our weekend hikes. I have a car that\\u2019s safe and spacious for dogs but I also started a new job that wouldn\\u2019t allow me the time to actually adopt a dog.\\n\\nAre there shelters in or around Glasgow that would let me take a dog a walk on Saturdays does anyone know? \\n\\nI tried looking at dogs trust but it seems there needs to be a vacancy for volunteer roles and there\\u2019s not any right now \", \"author\": \"Empty-Description589\", \"timestamp\": \"2025-08-25T10:44:03.171966\"}",
    "1mzmsmz": "{\"text\": \"Does the Council still have online chat available Used to be that reaching the council by phone was completely impossible, but the website had a live-chat feature that genuinely worked well. Quick, accurate advice by an actual human. But that seems gone as well now?\\n\\nI spend ages looking through their confusing [new website](https://www.glasgow.gov.uk/article/1544/Contact-Us) and the [MyGlasgowCC App](https://www.glasgow.gov.uk/MyGlasgowCC) they constantly redirect you to, and while I see Live Chat mentioned in various places there is no way I can find to start it. Used to be that (on a computer) the website would just have the live chat button on the bottom left of the screen, but now it's gone or extremely well hidden.\\n\\nAm I just being a moron? Does anyone have better ways to contact them with questions about Council Tax?\", \"author\": \"RGodlike\", \"timestamp\": \"2025-08-25T10:44:03.280817\"}",
    "1mznjxr": "{\"text\": \"Pizza Hut suddenly closes down well-known Glasgow venue \", \"author\": \"ReligiousClam\", \"timestamp\": \"2025-08-25T11:14:55.081108\"}",
    "1mzoyq0": "{\"text\": \"How\\u2019s this possible? With the number of roadworks in Glasgow alone how is it that this company could go bust?\\n\\nTraffic management firm ceases trading with loss of 119 jobs https://www.bbc.com/news/articles/c9qy37p0l18o\", \"author\": \"MHR1980\", \"timestamp\": \"2025-08-25T12:35:39.956932\"}",
    "1mzomfx": "{\"text\": \"Cheese board/platter recommendations around Glasgow I'm looking for any places that do them this weekend. I'm craving one and wanna treat myself after payday\", \"author\": \"Inner_Collection4486\", \"timestamp\": \"2025-08-25T12:35:40.094282\"}",
    "1mzq9su": "{\"text\": \"Restaurant in front of flat building keeps desposing of their trash in our garbage cans. What can we do? Self-explanatory title. They keep throwing their garbage in our trash cans to the point where we don't have space for our domestic trash. They overfill them to the point where we the residents keep getting in trouble with the Council and the local trash disposal team; the trash just started surrounding our flat building and it's getting pretty disgusting.\\n\\nAny tips? Who can I call?\", \"author\": \"LittleSadPluto\", \"timestamp\": \"2025-08-25T13:19:35.383690\"}",
    "1mzq8z1": "{\"text\": \"Nothing, Nowhere in Glasgow - what's the vibe like (going solo!) Just grabbed a ticket for Nothing, Nowhere in Glasgow! I actually had a ticket for the Prague show that got canceled because of the pandemic, so this is kind of a dream come true for me.\\n\\nFlying in from Sweden, so it\\u2019s a bit of a trip. I used to spend a lot of time in Edinburgh between 2013 and 2018 (haven\\u2019t been back since), so it\\u2019ll be a nice little reunion with Scotland too.\\n\\nOnly issue (besides having zero clue what outfit to wear lol) is that I\\u2019m going solo.\\n\\nAnyone here gone to a Nothing, Nowhere show alone before? What\\u2019s the vibe like? Easy to meet people and hang out? What kind of crowd usually shows up? I\\u2019m a woman in my 30s if that matters.\\n\\nNot scared of a moshpit, and definitely planning to push for front row if I can!\\n\\nAnd hey, if anyone else here is going to the Glasgow show\\u2026 pls adopt me. I jump and dance harder now than I ever did in my 20s, scream every lyric like my life depends on it, and I genuinely don\\u2019t care about age (my friends range from 20 to 60). Basically: I\\u2019ll be your chaotic concert buddy, hype you up, and probably lose my voice in the process. \\ud83d\\ude05\", \"author\": \"KawaiiMom1\", \"timestamp\": \"2025-08-25T13:19:35.441528\"}",
    "1mzqqfz": "{\"text\": \"New venue proposed for Hyndland parish church. \\nhttps://publicaccess.glasgow.gov.uk/online-applications/applicationDetails.do?activeTab=makeComment&keyVal=SZ1036EXKNX00\\n\\nNew jazz and folk venue proposed.\\n\\nLots of docs on the council website.\\n\", \"author\": \"xxx654\", \"timestamp\": \"2025-08-25T13:46:45.811075\"}",
    "1mzqcg6": "{\"text\": \"Would You Like To See This In Glasgow? Would you be keen to try this if it were available in the shops in Glasgow? \\n\\nWhilst there are other breweries out there who do an \\\"Irn Bru\\\" style sour beer this brewery based in Dundee by the name of LAW Brewing were the OG of this beer before the other bigger breweries came on board. \\n\\nI'm happy to get this into places if anyone is keen? \\n\\nJust say where is a local shop and I'll look to chat with the boss of the shop. \\n\\nCheers \\ud83c\\udf7b\", \"author\": \"Emily_Green_\", \"timestamp\": \"2025-08-25T13:46:45.920723\"}",
    "1mzrcno": "{\"text\": \"For all those interested in the Star Bar makeover, it doesn't seem like that much is going to be changed | The Bell (headline related to a different story in the briefing) \", \"author\": \"Historical_Sir5263\", \"timestamp\": \"2025-08-25T14:17:39.459766\"}",
    "1mzt8as": "{\"text\": \"How unsafe is glasgow, really? Hi everyone, I\\u2019m going to be in Glasgow for a really short time for a course at UofG but I\\u2019ve been hearing a lot of things especially on reddit. Is it really unsafe or are the rumors exaggerated? Especially considering I\\u2019m a single girl not from the UK going to live alone. I also wanted to hear your opinions about where to live, I have two options one in Kinning park/Paisley road and the other is less expensive and near Yate street close to celtic park. I couldn\\u2019t find anything suitable in the city center. Anyway, please let me know what you guys think and which area do you recommend and is safer.\", \"author\": \"TulipML\", \"timestamp\": \"2025-08-25T15:18:10.480161\"}",
    "1mzt74o": "{\"text\": \"Thoughts on living in EK please? I'm thinking of buying a house in the Merlin Gardens Estate as it seems to have the retail park nearby and it's close enough to the train station, but I keep hearing that Jackton is the place to be - why? There's nothing nearby Jackton and looks to be very isolated.\\n\\nI'd buy in the Southside if I could afford it, but it's out of my budget now.\\n\\nHeard the weather can be awful in EK too, but unsure how true this is?\", \"author\": \"GlasgowPotato\", \"timestamp\": \"2025-08-25T15:18:10.591880\"}",
    "1mzu0q8": "{\"text\": \"Can anyone recommend a lawyer/solicitor? Hope this is allowed! Don't really want to go into it but I'm looking to claim for negligence and need recommendations. Preferably a firm you have had experience with! \\n\\nThanks \", \"author\": \"HylianPalian\", \"timestamp\": \"2025-08-25T15:51:36.192279\"}",
    "1mzuwhs": "{\"text\": \"Moving companies (and prices!) you used? Hi all, I'm considering getting a moving company to assist moving from one flat to another, both in G postcodes.\\n\\nI've seen a few moving company recommendations but wanted to ask again and ask for prices you paid. I'm not moving much stuff outside of boxes and a couple of chest of drawers so looking to go cheap as possible! \", \"author\": \"ResolutionHot3188\", \"timestamp\": \"2025-08-25T16:20:55.108594\"}",
    "1mzurkv": "{\"text\": \"Littlehill golf course Do people walk on? \\nWhen does starter box close? \\nIs the course well kept? \\nAny local knowledge that is good to know would be appreciated thanks\", \"author\": \"mattycranners\", \"timestamp\": \"2025-08-25T16:20:55.216479\"}",
    "1mzugzi": "{\"text\": \"6/7am Martial Arts classes Hi, does anyone know of any martial arts classes (Kickboxing, MT, BJJ, MMA) in Glasgow and surrounding area between 5-8?! \\n\\nTIA. \", \"author\": \"lostnov04\", \"timestamp\": \"2025-08-25T16:20:55.306200\"}",
    "1mzuare": "{\"text\": \"Can anyone recommend a more \\\"high end\\\" gym in Glasgow? Preferably city centre? I've been a member of Pure Gym for years, but I am looking for a more high end gym. I've tried the village and that is high end in price but the gym is fucking shit. \\n\\nI've tried different studios, and I know of the extreme gym, which i haven't tried. But I think that's something along the lines I'm looking for or the kilo club in St Andrews. \\n\\nIs there anything like that in the city? \", \"author\": \"Strict-Brick-5274\", \"timestamp\": \"2025-08-25T16:20:55.387696\"}",
    "1mzu8iw": "{\"text\": \"Silhouettes \", \"author\": \"naFteneT\", \"timestamp\": \"2025-08-25T16:20:55.491030\"}",
    "1mzvkkz": "{\"text\": \"East Kilbride Station embarks on a new era \", \"author\": \"mrjohnnymac18\", \"timestamp\": \"2025-08-25T16:46:58.049022\"}",
    "1mzvcla": "{\"text\": \"Parking permit renewal Anyone else had issues renewing their permits through the RingGo website? I\\u2019ve had the notification through to renew it but the website just isn\\u2019t letting me \\ud83e\\udd74\", \"author\": \"omnomnomdeplume94\", \"timestamp\": \"2025-08-25T16:46:58.112168\"}",
    "1mzwd5j": "{\"text\": \"Hello, don\\u2019t suppose anyone here knows what chemicals Glasgow CC use when they remove graffiti? I know they can use pressure washers and sand blasting for certain surfaces, but do they also use any washes or specific products to clean it off? Many thanks.\", \"author\": \"IStabAtThee_sorry\", \"timestamp\": \"2025-08-25T17:13:17.523770\"}",
    "1mzwuic": "{\"text\": \"Puppy Classes around Glasgow Hello! \\n\\nWe are looking for puppy classes in Glasgow and west of Glasgow, dumbarton-ish area too.\\n\\nWe had one but they had quite old methods, like flicking the dogs nose and pinning the puppy down etc, which we definitely didn't agree with.\\n\\nAny recommendations would be appreciated! \", \"author\": \"Tweeky91\", \"timestamp\": \"2025-08-25T17:31:14.043426\"}",
    "1mzwrlb": "{\"text\": \"Marks & Spencer Byres Road Closing Closes on 25th October. Pish.\", \"author\": \"Artemio_Germain\", \"timestamp\": \"2025-08-25T17:31:14.112948\"}",
    "1mzxakd": "{\"text\": \"Fire behind house of sher Just gone over Kingston bridge.  Good going  fire under the ski ramp exits, black smoke blowing  onto the carriageway \", \"author\": \"LowEnergy1169\", \"timestamp\": \"2025-08-25T17:49:44.604951\"}",
    "1mzx8hb": "{\"text\": \"Why are Scotrail so shitty and rude? Bought an off peak ticket on Trainline with a railcard, everything was legit and I've done it dozens of times before. Suddenly a conductor tells me my ticket's not valid and he should charge me \\u00a312 for a 4 min train journey that literally costs \\u00a32.20 return without a railcard. Asked why and he said you can't use your railcard before 10am as it's not off peak. Trainline literally says off peak day return for the time I travelled. Tried it on the Scotrail app and exactly the same thing comes up! Even says the railcard discount has been applied when I don't think it has or it would have stupidly boosted the price to \\u00a312, which it didn't. Also not Scotrail but Railcard - what is the logic of a railcard not being allowed for \\\"commuter trains\\\" unless you have a senior railcard!?!? So fucking stupid and the Glasgow staff were so jobsworthy and dismissive of the fact that the system is ridiculous I'm raging\", \"author\": \"Lopsided-Abalone-373\", \"timestamp\": \"2025-08-25T17:49:44.700134\"}",
    "1mzy320": "{\"text\": \"City of Glasgow College online lectures? I\\u2019m confused on my timetable for COGC\\n\\nI\\u2019ve been given the room allocations, but next them in brackets it says \\u201cteams\\u201d\\n\\nDoes that mean it\\u2019s online? Or is it group work?\", \"author\": \"Emmie-Emz\", \"timestamp\": \"2025-08-25T18:24:56.531033\"}",
    "1mzyw22": "{\"text\": \"Where is good on a Monday night? Hey heading into town tonight and want to know where is good on a Monday night? \", \"author\": \"Lilybillyxox\", \"timestamp\": \"2025-08-25T18:49:34.014948\"}",
    "1mzyidy": "{\"text\": \"Gtf ya Tory \\ud83d\\udd14end BBC News - Scottish Tory leader says asylum hotel protests 'understandable' - BBC News\\nhttps://www.bbc.co.uk/news/articles/c4gzyd727x2o\", \"author\": \"kaluna99\", \"timestamp\": \"2025-08-25T18:49:34.071335\"}",
    "1mzzihf": "{\"text\": \"Glasgow airport parking discount Due to a very tight schedule I need to park in the multi story car park and get priority security for the airport. I\\u2019m sure I seen a parking discount code a few weeks back on the motorway flyover advertising board, does anyone remember the code? \", \"author\": \"WarmFlamingo9310\", \"timestamp\": \"2025-08-25T19:13:22.328438\"}",
    "1mzr3m5": "{\"text\": \"Civerinos gross Was working at civs till last feb, they had no grease trap and it was backed up with sewage. Prep chef decided that \\u2018he didn\\u2019t have the luxury of using any sink he likes\\u2019 in the prep kitchen, so purposefully flooded an un-drainable sink, which backed up into the grease trap, which backed up into sewage. Essentially, the prep kitchen was perpetually full of sewage. They fired me for being ill. Lol.\", \"author\": \"Bachquino\", \"timestamp\": \"2025-08-25T19:13:22.396064\"}",
    "1mzzvfr": "{\"text\": \"Has anyone installed outside bike storage for a residential flat? I\\u2019ve just bought a bike but it\\u2019s quite heavy and due to the layout of the stairwell and doors it\\u2019s quite tricky getting it in and out of my flat every time.\\n\\nI own my flat and have two assigned parking spaces (set out in the deeds) but I don\\u2019t have (or want) a car.\\n\\nHas anyone else in this situation installed outside storage for a bike? It would be great to install some kind of hanger/rack and I\\u2019d be happy for other residents to use it too. We\\u2019re set back from the road and there\\u2019s only a few flats.\\n\\nThe flats are factored - I have no idea where to start with this, is it something I can just do since I own the flat and the parking space or is it something I have to ask the factors about?\\n\\n\", \"author\": \"ilovescones\", \"timestamp\": \"2025-08-25T19:27:10.647788\"}",
    "1n008fh": "{\"text\": \"What is this tower thing(M74) Seen this get put up a few months ago, anyone any idea what it is? I was thinking some emissions monitor but it's a bit over the top for that I think \\ud83e\\udd14\", \"author\": \"Typical_Rip_1818\", \"timestamp\": \"2025-08-25T19:38:15.793260\"}",
    "1n01wel": "{\"text\": \"121 Spanish Tutor Anyone know of any 121 private Spanish tutors for adult learners in Glasgow? cheers :) \", \"author\": \"lapsedflutephobe\", \"timestamp\": \"2025-08-25T20:40:32.467853\"}",
    "1n028qo": "{\"text\": \"Loft flooring/storage in Glasgow and surrounding areas Hi folks,\\n\\nI\\u2019m looking to get my loft partially floored and some basic storage solutions put in (nothing fancy, just safe and practical). I\\u2019d like to hear if anyone has had good experiences with companies in or around Glasgow that do this kind of work.\\n\\nMain things I\\u2019m after:\\n\\n* A reputable company/tradesperson (ideally someone you\\u2019ve used yourself)\\n* An indication of what a realistic and fair price would be - don\\u2019t want to get ripped off\\n* Good quality work and reliability\\n* Ladder isn't necessary, but if the cost isn't a huge difference, would definitely consider including it\\n\\nAppreciate the cost one might be hard to answer, as it'll depend on a few factors, I know. If it helps, the space would be around 2.7m width, 3.6m length (for the main bit - it is bigger but I don't think I need under the water tank etc floored)  \\n  \\nI've been hit with about 400 ads on FB/Instagram/Google since clicking on one, but all have quite mixed reviews and small numbers of reviews, so not sure how good a representation they are. \\n\\nIf you\\u2019ve had loft flooring/storage done recently, who did you go with, and would you recommend them? Any ballpark idea of costs would be super helpful too.\\n\\nCheers!\", \"author\": \"Sure_Debate_7646\", \"timestamp\": \"2025-08-25T20:50:41.178665\"}",
    "1n07y1x": "{\"text\": \"Quit smoking and I've got 50g bags of amber leaf to get rid of I have recently quit smoking and I'm hoping to get rid of 50g pouches of amber leaf. Currently going for 43.35 at Tesco. Anyone keen on buying for \\u00a330? \\n\\nHoping to get it gone asap so I dont have temptation, so ideally selling multiple pouches at once. Any interest? \\n\\nBased near Sauchiehall so could meet at the Gregg's there. Dm me\", \"author\": \"NipFiend\", \"timestamp\": \"2025-08-26T01:18:58.253331\"}"
  },
  "last_updated": "2025-08-26T02:53:24.971009",
  "total_posts": 148
}