{
  "seen_posts": {
    "1mxa6j7": "2025-08-23T17:12:51.791100",
    "1mxbj1u": "2025-08-23T17:12:51.791100",
    "1muegll": "2025-08-23T17:12:51.791100",
    "1my62nk": "2025-08-23T17:12:51.791100",
    "1mwqph9": "2025-08-23T17:12:51.791100",
    "1my34rr": "2025-08-23T17:12:51.791100",
    "1mx6ah9": "2025-08-23T17:12:51.791100",
    "1mxvwqz": "2025-08-23T17:12:51.791100",
    "1my3k7p": "2025-08-23T17:12:51.791100",
    "1mxe1ej": "2025-08-23T17:12:51.791100",
    "1mxnii5": "2025-08-23T17:12:51.791100",
    "1mxhuqt": "2025-08-23T17:12:51.791100",
    "1mxl1i3": "2025-08-23T17:12:51.791100",
    "1mxyqrq": "2025-08-23T17:12:51.791100",
    "1mxzksq": "2025-08-23T17:12:51.791100",
    "1muiuig": "2025-08-23T17:12:51.791100",
    "1mwxiyr": "2025-08-23T17:12:51.791100",
    "1mxxlbe": "2025-08-23T17:12:51.791100",
    "1mxh75t": "2025-08-23T17:12:51.791100",
    "1mx925s": "2025-08-23T17:12:51.791100",
    "1mx1k1t": "2025-08-23T17:12:51.791100",
    "1mwxbxg": "2025-08-23T17:12:51.791100",
    "1mxxwsw": "2025-08-23T17:12:51.791100",
    "1mptiyv": "2025-08-23T17:12:51.791100",
    "1mww1n1": "2025-08-23T17:12:51.791100",
    "1my00ad": "2025-08-23T17:12:51.791100",
    "1mx3ewm": "2025-08-23T17:12:51.791100",
    "1mx5h1d": "2025-08-23T17:12:51.791100",
    "1mx2tad": "2025-08-23T17:12:51.791100",
    "1mwt3h0": "2025-08-23T17:12:51.791100",
    "1mxyoml": "2025-08-23T17:12:51.791100",
    "1mxywey": "2025-08-23T17:12:51.791100",
    "1mwpv9u": "2025-08-23T17:12:51.791100",
    "1mx0ye7": "2025-08-23T17:12:51.791100",
    "1mwsrbj": "2025-08-23T17:12:51.791100",
    "1mrtlk5": "2025-08-23T17:12:51.791100",
    "1mxsjjh": "2025-08-23T17:12:51.791100",
    "1mmstyr": "2025-08-23T17:12:51.791100",
    "1mxve5w": "2025-08-23T17:12:51.791100",
    "1mwnv1t": "2025-08-23T17:12:51.791100",
    "1mwdzqj": "2025-08-23T17:12:51.791100",
    "1mxozzf": "2025-08-23T17:12:51.791100",
    "1mwmhag": "2025-08-23T17:12:51.791100",
    "1my5r3y": "2025-08-23T17:12:51.791100",
    "1mx8xdt": "2025-08-23T17:12:51.791100",
    "1mxvz2c": "2025-08-23T17:12:51.791100",
    "1mxhsov": "2025-08-23T17:12:51.791100",
    "1mmkykr": "2025-08-23T17:12:51.791100",
    "1my0b3v": "2025-08-23T17:12:51.791100",
    "1my1bf2": "2025-08-23T17:12:51.791100",
    "1mxrf64": "2025-08-23T17:12:51.791100",
    "1mxywel": "2025-08-23T17:12:51.791100",
    "1mxybwa": "2025-08-23T17:12:51.791100",
    "1mxcshm": "2025-08-23T17:12:51.791100",
    "1my5unp": "2025-08-23T17:12:51.791100",
    "1mwoufm": "2025-08-23T17:12:51.791100",
    "1mn6egs": "2025-08-23T17:12:51.791100",
    "1mxdx4j": "2025-08-23T17:12:51.791100",
    "1mx50fu": "2025-08-23T17:12:51.791100",
    "1my0aqj": "2025-08-23T17:12:51.791100",
    "1mx4por": "2025-08-23T17:12:51.791100",
    "1muipkp": "2025-08-23T17:12:51.791100",
    "1mx156f": "2025-08-23T17:12:51.791100",
    "1mxfv69": "2025-08-23T17:12:51.791100",
    "1mwmt93": "2025-08-23T17:12:51.791100",
    "1mxzgrc": "2025-08-23T17:12:51.791100",
    "1mxy384": "2025-08-23T17:12:51.791100",
    "1mp39ps": "2025-08-23T17:12:51.791100",
    "1mwslej": "2025-08-23T17:12:51.791100",
    "1mohb01": "2025-08-23T17:12:51.791100",
    "1my8jon": "2025-08-23T18:20:55.927633",
    "1mya2jx": "2025-08-23T19:12:05.903819",
    "1myc3u8": "2025-08-23T20:38:11.743619",
    "1myde3o": "2025-08-23T21:28:35.295151",
    "1myb120": "2025-08-23T22:14:55.567992",
    "1myf8tq": "2025-08-23T22:49:48.149870",
    "1myjsmf": "2025-08-24T03:06:09.170159",
    "1myjnqt": "2025-08-24T03:06:09.170213",
    "1myn2cw": "2025-08-24T05:16:24.771755",
    "1mymsfc": "2025-08-24T05:16:24.772007",
    "1myqtdz": "{\"text\": \"Books for sale Bundle of books I'm finished with and looking to get rid of.\\n\\u00a320\\n25 books in total.\\nPick up Anniesland/Knightswood \", \"author\": \"sunshinedeadhead\", \"timestamp\": \"2025-08-24T09:15:36.916539\"}",
    "1myshcp": "{\"text\": \"Live music - today Does anyone know of places that have music on this afternoon? \", \"author\": \"1514RobbieDye\", \"timestamp\": \"2025-08-24T11:12:36.877321\"}",
    "1myuc88": "{\"text\": \"Any advice for terrible neighbours. I recently moved to the Firhill area, and my upstairs neighbours are driving me fucking insane. From  10 AM until as late as 5 AM, they\\u2019re constantly blasting music. I\\u2019ve tried speaking to them, but they won\\u2019t even open the door. I\\u2019ve spoken to my landlord, and his only suggestion was to call the police \\u2014 but I don\\u2019t want to escalate it that quickly. Does anyone have any advice on how to get them to shut up?\", \"author\": \"Hiccupping_Raven\", \"timestamp\": \"2025-08-24T12:31:39.721327\"}",
    "1myue27": "{\"text\": \"Yellow walkers I\\u2019m currently seeing lots of people in yellow walking past Kelvingrove art gallery from my window\\u2026 just being nosey and wondering if anyone knows what\\u2019s going on \\ud83d\\ude02\", \"author\": \"Budget_Twist_2767\", \"timestamp\": \"2025-08-24T13:07:01.340574\"}",
    "1myvbp1": "{\"text\": \"Shipping parcels to EU I am moving to Paris, so I though I would post some of my belongings (mostly clothes, shoes and personal items) rather than carrying everything. Which provider would you suggest that are cheaper and easy to use? I do not care about the fast service. Also, do I need to complete a customs declaration or some documents even if it's not for sale? some of the website ask for detailed description of every item.\\n\\nThanks\", \"author\": \"Pure_Leather_3396\", \"timestamp\": \"2025-08-24T13:34:11.809527\"}",
    "1myvu2r": "{\"text\": \"Council tax So it\\u2019s South Lanarkshire council that charge me. I seem to\\nBe overpaying and have been for a while. I am\\nBeing charged more than even the highest bracket in my area so there\\u2019s really no rhyme or reason that it should be as much. I\\u2019m really annoyed at this as I have been under a lot of strain financially and this has made it worse of course.  I have also asked about it before but been fobbed off. So my question is what or who should I contact in the council for a quick and fair review of this. And has anyone had similar and what was the outcome. \\nThanks. \", \"author\": \"amandathepanda51\", \"timestamp\": \"2025-08-24T13:49:50.293015\"}",
    "1mywvh6": "{\"text\": \"saw this in bell street and wtf was just passing by w a friend and it was so damn smelly. can't help but cover my nose. anyone know what this is? \", \"author\": \"yumenogarden\", \"timestamp\": \"2025-08-24T14:31:49.865302\"}",
    "1myxfv6": "{\"text\": \"Making pals I\\u2019m a 21 year old female, I stay like half hour/40 mins outside of Glasgow and I want to meet some pals, I never done uni or anything so didn\\u2019t get a chance to make mates that way. I have a group of pals that I\\u2019m close with but I feel I want to live life a bit more than they do!! aka go out, book holidays and go to raves \\ud83e\\udd23 if anyone is similar minded to me drop me a message or if anyone knows any like groups or anything please let me know! I feel like a bit of a loser posting this lol but promise I\\u2019m normal \\ud83e\\udd23\", \"author\": \"Legal_Nefariousness7\", \"timestamp\": \"2025-08-24T14:49:33.816769\"}",
    "1myxd4x": "{\"text\": \"Me taking pictures of Glasgow\\u2019s Vintage Bus Day last year \\n\\n\\ud83d\\ude8c Any vintage transport lovers here? \\n\\nAfter living in Glasgow for a whole year, I thought I\\u2019d seen it all: the art, the music, the museums\\u2026 but then I stumbled upon the Glasgow Vintage Bus Day\\u2014 and honestly? It completely stole my heart. \\ud83d\\udc98\\n\\nThere\\u2019s something magical about seeing these beautifully preserved buses\\u2014from the '50s right through to the '90s\\u2014rolling through the city streets today.\\n\\nAs a photography lover, these might be the best shots I\\u2019ve ever taken in Glasgow. Shooting this event gave me the vibe of watching a city gently rewind time. The buses don\\u2019t feel like museum pieces\\u2014they feel alive, and they belong, elegantly matching the vibe of Glasgow\\u2019s beautiful architecture.\\n\\n\\u2728 Highlights:  \\nThese beautifully preserved historical vehicles are maintained and displayed by the **Glasgow Vintage Vehicle Trust (GVVT)**. Anyone who is interested is free to explore more on their official website:  \\ud83d\\udc47\\n\\ud83d\\udd17 https://gvvt.org/visiting-us\", \"author\": \"EntertainerJolly8982\", \"timestamp\": \"2025-08-24T14:49:33.909268\"}",
    "1myzkiw": "{\"text\": \"New Diamond chinese My closest Chinese takeaway is the New Diamond on McNeil Street, I've used them since they opened last year, never had a problem. \\n\\nOn Friday, I placed an order on their website, all went through, but it never came. After 90 minutes, I walked over and saw the shutter was down and they were closed! I then went on deliveroo to see if they were taking orders there but they weren't.\\n\\nThey're still closed today, and the phone hasn't been answered, any one have any suggestions how to get my money back?\", \"author\": \"Swimming-Pirate-2458\", \"timestamp\": \"2025-08-24T16:18:52.444697\"}",
    "1mz1pry": "{\"text\": \"Why is this terrace so cheap? [4 bedroom terraced house for sale in Dowanside Road, Dowanhill, Glasgow, G12](https://www.rightmove.co.uk/properties/163308365#/?channel=RES_BUY)\\n\\n  \\nSorry but I was browsing for houses I could never afford as u do and saw this was only 855k? The inside is insane. Are they normally this cheap or is there something I should know?\", \"author\": \"Queasy_Champion_681\", \"timestamp\": \"2025-08-24T17:30:12.468769\"}",
    "1mz1zm4": "{\"text\": \"Migraines Odd question.  Has anyone experienced a huge ramp up in the number of migraines they have over the past few weeks.  I have migraines that are weather dependant. High fluctuations in atmospheric pressure.  Checking if it has just been really terrible weather of late or is my brain broken.\", \"author\": \"Rogertron88\", \"timestamp\": \"2025-08-24T17:42:09.262571\"}",
    "1mz2ww7": "{\"text\": \"Glasglow Never attended it\\u2019son \\u2018Glasglow\\u2019 looking for any tips for on the day with a 1 year old. Is there parking close by as one of our group is disabled and has a blue badge? \", \"author\": \"Cold_Day17\", \"timestamp\": \"2025-08-24T18:21:36.519866\"}",
    "1mz3q96": "{\"text\": \"Chinese restaurants fly tipping Honestly sick of the amount of fly tipping coming from the restaurants around me. During the week, there were 12 black bags left lying in the bin store, along without about 10 cardboard boxes. Making it worse, the bins were predominantly empty so could have at least been disposed of.  Worse again, was the fact tonnes of it was food and that was on the ground due to the seagulls, rats enjoying their free meals. \\n\\nToday when trying to give the bin store a tidy up, the smell was rotten and actually nearly made be add to the mess! When you do catch the guys, it's great, but they like to appear in the early hours now and you can't just stay up to catch them. Anyone else having the same issues, and any thoughts/actions what to do? Bin stores are in our car park and I have one of the larger stores, so always the targeted one.\\n\\nI'm G4 area, so maybe you have the same issues where you are!\", \"author\": \"Overall-Bar-2939\", \"timestamp\": \"2025-08-24T18:45:36.211256\"}",
    "1mz4rtm": "{\"text\": \"Dropped my earphones somewhere in the city centre, would appreciate if anyone finds them. Hi, I was riding around on my bike and my earphones case slipped out my pocket. I know it doesn't cost too much for a replacement but I'd rather just wait.  would really appreciate if anyone has seen them and picks them up.\", \"author\": \"Pitiful_Storage_8069\", \"timestamp\": \"2025-08-24T19:25:26.930621\"}",
    "1mz4mh4": "{\"text\": \"A Glasgow icon And a can of Bru\", \"author\": \"shakingandwithdrawn\", \"timestamp\": \"2025-08-24T19:25:26.994401\"}",
    "1mz51jw": "{\"text\": \"Anyone know of any lockups going? Hey folks\\n\\nI'm in need of a lockup, mainly for storage, little bit for doing work in (fiddling with a classic car, storing my stuff well I move house). \\n\\nCan't for the life of me find anything other than self store places, does anyone know of anything going, preferably in the west (I'm between Inverclyde & North Ayrshire currently). \", \"author\": \"CAElite\", \"timestamp\": \"2025-08-24T19:36:43.584538\"}",
    "1mz1n72": "{\"text\": \"Internal soil stack replacement recommendations Old tenement problems\\u2026 anyone had an internal stack replaced? Needing some recommendations for a good plumber. Seems pretty difficult to find anyone willing to do this. \", \"author\": \"Sorry_Shake_9372\", \"timestamp\": \"2025-08-24T19:49:25.412451\"}",
    "1mz5g8g": "{\"text\": \"Filming on Cochrane Street yesterday Does anyone know what was being filmed down there yesterday? They had created a NYC street but were keeping very tight-lipped about what they were filming. \\n\\nOn an earlier post someone mentioned Spiderman 4 was being filmed in Glasgow, but that was about a week ago I think.\", \"author\": \"MLC1974\", \"timestamp\": \"2025-08-24T19:49:25.544311\"}",
    "1mz5yj1": "{\"text\": \"Photographer I'm looking for a photographer from Glasgow or nearby who could do an outdoor couple photoshoot. Do you recommend anyone?\", \"author\": \"forestxxfae\", \"timestamp\": \"2025-08-24T20:17:23.163362\"}",
    "1mz5mj7": "{\"text\": \"Junk left by previous tenants Need some advice on how to properly deal with this\\n\\nI live in a building with 4 flats, I own mine and the other three are private rents\\n\\nIn the building we have a communal room with no obvious use\\nI think it used to be a flat in the past but has been gutted for some reason\\n\\nMy issue is that the room is completely filled wall to wall with junk \\nOld mattresses, bags of clothes, old suitcases, broken and dismantled ikea furniture, tins of paint, a massage table and a small tank of butane \\n\\nEverything in there has been dumped by previous tenants who have moved out \\n\\nThis room is directly located under my flat and it goes without saying I\\u2019m nervous about it potentially being a fire hazard given what\\u2019s inside it\\n\\nI\\u2019m in a group chat with the landlords of the building and sent pictures of the junk and spoke to them about getting everything removed as I\\u2019d like to make some repairs to that room as it makes my flat freezing cold in the winter\\n\\nIt\\u2019s been a month now since I\\u2019ve had any response even after some of them saying they would come and remove their previous tenants stuff\\n\\nOn top of that one of the landlords has taken up the entire shared roof terrace with their flowerbeds and vegetable plots which have been left to rot and be overgrown with weeds\\nThey have an old bath that was used as a water butt and is now just filled with stagnant brown water.\\nThere also three wheelie bins converted into compost bins that are just completely stinking and swarming with flies\\nNot to mention all the gardening supplies and bags of fertiliser stored next to this junk room \\n\\nI\\u2019m pretty unhappy with all this as I couldn\\u2019t make much use of the terrace when the weathers been good and I\\u2019m constantly nervous about that room catching fire as someone has been smoking in the stairwell and the hallway outside that room\\n\\nWho exactly could I go to, to get help with this?\\nCould I face any sort of legal trouble for just going ahead and removing this stuff myself?\\nEven though it\\u2019s been left behind someone at work since it\\u2019s not my property I could be accused of stealing \\nThe landlords in the building were completely disinterested and were just stand offish and rude when I spoke to them so I\\u2019m just done dealing with them\\n\\nI\\u2019ve been told the environmental health department of Renfrewshire council could get involved and someone even suggested speaking to my local MSP but I honestly don\\u2019t know where to begin and would prefer to get this dealt with as quickly as possible \\n\\nAny idea would be appreciated thanks \\n\", \"author\": \"Craigermeister69\", \"timestamp\": \"2025-08-24T20:17:23.228393\"}",
    "1mz67vt": "{\"text\": \"Stride Athletics Urban Orienteering - Wednesday 27 August Urban orienteering in Kelvingrove from 6pm. Registration at Inn Deep.\\n\\nLink: https://www.eventbrite.com/e/stride-athletics-glasgow-urban-orienteering-2-tickets-1503859958619?aff=erelexpmlt&_gl=1*6m5crj*_up*MQ..*_ga*NDkxMjY3MjM2LjE3NTYwNjYwMjY.*_ga_TQVES5V6SH*czE3NTYwNjYwMjUkbzEkZzAkdDE3NTYwNjYwMjUkajYwJGwwJGgw\", \"author\": \"MickIAC\", \"timestamp\": \"2025-08-24T20:17:24.381381\"}",
    "1mz6fab": "{\"text\": \"No lights, no helmet, no clue \", \"author\": \"UmpireOne357\", \"timestamp\": \"2025-08-24T20:38:58.380120\"}",
    "1mz7es5": "{\"text\": \"Lost Dog Near Knightswood Hey, this little guy was outside our house just now and no one nearby knows who\\u2019s dog it is. If anyone is missing a small white male dog please message me. \", \"author\": \"connor03_\", \"timestamp\": \"2025-08-24T21:40:56.036124\"}",
    "1mz968m": "{\"text\": \"Anniesland versus Kilbride Hi all\\nMy husband and I are planning to move to Glasgow together. He already lives there and I\\u2019m moving with him but he\\u2019s a bit clueless about areas in Glasgow because he spends 99% of his time at work\\ud83d\\ude02. We\\u2019ve found two apartments:\\n1 bed in Anniesland, near to transport and grocery shops. 2 bed in Kilbride, a bit further from transport and grocery shops. \\n\\nWhich area would you recommend for us? \", \"author\": \"Confusedbrownwoman\", \"timestamp\": \"2025-08-24T22:15:36.093611\"}",
    "1mz9toj": "{\"text\": \"distraught!! just heard that the marks and spencer\\u2019s on byres road is closing this october and i am actually distraught. it\\u2019s always packed as well so i don\\u2019t get why they\\u2019d close it?? have no idea how im going to survive uni without having it so close by :((( \\n\\nedit: ok so apparently the uni is going to put in a plan to make student accommodation. GIVE ME A BREAK\", \"author\": \"Business_Abroad_31\", \"timestamp\": \"2025-08-24T22:49:23.732785\"}",
    "1mzb1c1": "{\"text\": \"Question about Citylink buses? I'm thinking about a trip from the US to Glasgow in October, but it's substantially easier for me to fly to Edinburgh rather than Glasgow airport because of costs, flight connections, etc.\\n\\nI see there is a Citylink bus service that appears to go from the airport right into Glasgow. I'm wondering how reliable this service is? I'm planning on attending the Scotland-Belarus match in Glasgow on the night of Sunday the 12th, and would likely be flying out the next morning so I'm just hoping I could plan on getting the bus from Glasgow in the morning to the airport without an issue. The flight out would be just before noon.\", \"author\": \"E51838\", \"timestamp\": \"2025-08-24T23:37:46.042983\"}",
    "1mzcvkd": "{\"text\": \"Attempted mugging Finnieston Some wee bams tried to mug me for my camera earlier this evening. I was getting a couple of beers in GG Bros and they bouled in, asking the owner daft questions about what he had in stock, wee guy comes right up to me and starts with the classic lines of, 'that's a nice camera', 'how much is it worth?' then starts to poke at it. He's taking the piss and I know what's coming next. As I leave, he follows me with some aggro chat, while also grabbing at his hoodie pocket like he has a knife so I turn to him and scream, \\\"GET THE FUCK AWAY FROM ME, NOW!\\\" I went full rozzer! He backs off but re-groups with his 4 or 5 pals. I had to get a taxi out of the area. I'd expect this kind of shit in Naples or parts of London but not Glasgow. Never thought I'd say this but the rozzers need to up their game. I've lived in Glasgow 34 years and never seen such brazen cheek!\", \"author\": \"Mr_Bear12345_6\", \"timestamp\": \"2025-08-25T01:20:53.271652\"}",
    "1mzhlol": "{\"text\": \"The Steamie - Monday 25 August 2025 **Travel**\\n\\n\\n\\nCancellations to services between Glasgow Central and East Kilbride\\n\\nDue to engineering works not being finished on time between Glasgow Central and Crossmyloof disruption is expected until 09:00 25/08.\\n\\nTrain services between Glasgow Central and East Kilbride may be cancelled, delayed or revised.\\n\\nOption 1 - Check if a rail journey is currently possible..\\n\\n* Use the National Rail Enquiries real-time journey planner to check if you can continue your journey by rail.\\n\\nOption 2 - Alternative Routes & Local Public Transport..\\n\\n* Please check alternative walking routes for services via Pollokshields West and Crossmyloof.\\n\\n* Please check alternative walking routes for services via Neilston and East Kilbride.\\n\\n* If you have had to drive to another station your ticket will be valid to collect your car on your return journey. Speak to a member of staff to validate your ticket.\\n\\n* Currently, we have not arranged for your rail tickets to be accepted on local bus routes as yet. We will monitor this situation as the incident develops.\\n\\nOption 3 - Rail Replacement Transport..\\n\\n* Currently, we have not requested Rail Replacement Transport. We will monitor this situation as the incident develops.\\n\\nOption 4 - Consider travelling later..\\n\\n* You might wish to consider postponing your journey until our service's return to normal.\\n\\nNetwork Rail have advised that engeineering operations in the Muirhouse area are currently over-running which is affecting our train services.\\n\\nStaff are working hard to get the works finished and to get all lines reopened with a current estimate of trains being able to operate at 0700.\\n\\nAlterations have been made to some early morning services. Please check your journey before you leave for the station.\\n\\nLet us help you:Please let us try and help you if you are being disrupted. At the station or on-train:* Speak to a member of staff or use the Help-point (station only).* Listen for announcements.* Information will be displayed on Customer Information Screens.Keep up to date or get in touch on your phone:Twitter:  Live updates @ScotRail.WhatsApp:  Contact us on WhatsApp.App:  Live updates on our app. Phone:  Contact Customer Relations.\\n\\nCancellations to services between Glasgow Central and Barrhead\\n\\nTrain services between Glasgow Central and Barrhead may be cancelled, delayed or revised.\\n\\nCustomers can travel on alternative routes.\\n\\n* Local services between Glasgow Central and Kilmarnock/Barrhead.\\n\\nCancellations to services between Glasgow Central and Kilmarnock\\n\\nTrain services between Glasgow Central and Kilmarnock may be cancelled, delayed or revised.\\n\\nCancellations to services between Glasgow Central and Neilston\\n\\nTrain services between Glasgow Central and Neilston may be cancelled, delayed or revised.\\n\\n* Glasgow Central - Newton for stations between Glasgow Central & Cathcart\\n\\n* Glasgow Central - Neilston for stations between Glasgow Central & Cathcart\\n\\nCancellations to services between Glasgow Central and Newton Lanark via Kings Park\\n\\nTrain services between Glasgow Central and Newton Lanark via Kings Park may be cancelled, delayed or revised.\\n\\nCancellations to services between Glasgow Central and Glasgow Central via Queens Park Strathclyde\\n\\nTrain services between Glasgow Central and Glasgow Central via Queens Park Strathclyde will be cancelled.\\n\\nTrain services between Glasgow Central and Glasgow Central via Maxwell Park will be revised.\\n\\n**Today in Scottish History**\\n\\n25 August 1819: The birth in Glasgow   of Allan Pinkerton, who would go on to  found  the Pinkerton Detective Agency in the United States.\\n\\n**/r/GlasgowMarket Digest**\\n\\n[Stride Athletics Urban Orienteering - Wednesday 27 August](/r/glasgowmarket/comments/1mz67vt/stride_athletics_urban_orienteering_wednesday_27/)\\n\\n[Books for sale](/r/glasgowmarket/comments/1myqtdz/books_for_sale/)\\n\\n[Anyone selling 2-3 esdee kid tickets for the 19th, can pay abit above also must provide legit proof of the tickets!](/r/glasgowmarket/comments/1mxbj1u/anyone_selling_23_esdee_kid_tickets_for_the_19th/)\\n\\n[2 VIP Tickets to Beluga Lagoon in Kelso with VIP Parking pass](/r/glasgowmarket/comments/1mwt3h0/2_vip_tickets_to_beluga_lagoon_in_kelso_with_vip/)\\n\\n[Looking for Alchemised Signing Ticket in Glasgow](/r/glasgowmarket/comments/1muiuig/looking_for_alchemised_signing_ticket_in_glasgow/)\\n\\n[New mechanic business Glasgow](/r/glasgowmarket/comments/1muipkp/new_mechanic_business_glasgow/)\\n\\n[boozy brunch tickets for sale](/r/glasgowmarket/comments/1muegll/boozy_brunch_tickets_for_sale/)\\n\\n**Tune of the day**\\n\\n[Let 3 - Mama \\u0160\\u010c! (LIVE) | Croatia \\ud83c\\udded\\ud83c\\uddf7 | Grand Final | Eurovision 2023](https://youtu.be/hGuGfdEJ5Pw) (suggested by /u/Queasy-Ice-2575) \\n\\nPicked from 3 eligible links submitted today. [Suggest tomorrow's tune](https://www.reddit.com/message/compose/?to=SteamieBot&subject=SongRequest&message=YouTube link here).\", \"author\": \"SteamieBot\", \"timestamp\": \"2025-08-25T05:18:08.136087\"}",
    "1mzjqwk": "{\"text\": \"Traditional Tattoo Anyone know of any artists that are good for traditional style tattoos? \", \"author\": \"Honey_Yoghurt99\", \"timestamp\": \"2025-08-25T07:17:34.104390\"}",
    "1mzkkbo": "{\"text\": \"Butcher\\u2019s steak pie recommendations Just learned that W Bishop butchers shut back in May! Gutted as they had the best steak pies around. Can anyone offer alternatives? TIA. \", \"author\": \"NSteel83\", \"timestamp\": \"2025-08-25T08:24:49.769768\"}",
    "1mzlkam": "{\"text\": \"Renting in Glasgow Hello!\\n\\nI\\u2019ve just moved back to Fife with my mum for a wee bit but planning on moving to Glasgow by the end of the year/new year with my partner, but increasingly worried about how difficult it\\u2019s been for friends who are trying to move to Glasgow/Edinburgh this September. I have a couple of questions I was wondering if yous could help me out with!\\n\\nI\\u2019ve got a good credit score, have lived in the same rented property from July 2018 till now, I am on PIP and limited capacity for work related activity which provides rent but I work freelance as well, I don\\u2019t have any savings lol but do have a UK guarantor! I\\u2019ve lived in the UK since I was 18 and paid rent reliably since then independently (I am a British citizen if that makes a difference in being easier for me to rent although it Shouldn\\u2019t \\ud83e\\udd28)\\nI\\u2019m looking for somewhere unfurnished in the southside and I also have a cat to add another complication with renting to the mix \\ud83d\\ude05\\n\\n1) Does there seem to be a difference in the craziness of applying for housing in the summer and the winter? My pals were saying like 20/30 ppl were applying for each house they were going for which feels nuts (but I guess makes sense as students looking at that time).\\n\\n2) Do you legally have to disclose if you are on benefits? I\\u2019m on PIP and Limited Capacity to Work but sometimes I do work freelance so technically my income is 24k\\u2026 but I\\u2019ve heard landlords are not favourable to rent with people with benefits so I\\u2019m hesitant to disclose it at all? They\\u2019ll be getting the money either way so\\u2026 \\n\\n3) any tips on how best to navigate the rental market would be great and also any letting agents to avoid like the plague?to \\n\\nThank you so much in advance! \", \"author\": \"vespertinefan\", \"timestamp\": \"2025-08-25T09:19:13.045592\"}",
    "1mzm5kt": "{\"text\": \"Maths tutoring - how much to charge? I\\u2019m 22 years old and just recently graduated with BSc Hons in Maths. I have very little classroom experience (part of my dissertation topic was around teaching maths and I visited a school in Glasgow and \\u2019taught\\u2019 a few lessons, except for that nothing else). How much would be fair per hour for teaching National 5 Maths in Glasgow?\", \"author\": \"Own-Syllabub-4848\", \"timestamp\": \"2025-08-25T09:51:32.549683\"}",
    "1mzkq13": "{\"text\": \"Dog shelters in Glasgow that would let me walk dogs as a volunteer? Pretty much as the title says. My dog passed over a 1yr ago now and I feel lost without our weekend hikes. I have a car that\\u2019s safe and spacious for dogs but I also started a new job that wouldn\\u2019t allow me the time to actually adopt a dog.\\n\\nAre there shelters in or around Glasgow that would let me take a dog a walk on Saturdays does anyone know? \\n\\nI tried looking at dogs trust but it seems there needs to be a vacancy for volunteer roles and there\\u2019s not any right now \", \"author\": \"Empty-Description589\", \"timestamp\": \"2025-08-25T10:44:03.171966\"}",
    "1mzmsmz": "{\"text\": \"Does the Council still have online chat available Used to be that reaching the council by phone was completely impossible, but the website had a live-chat feature that genuinely worked well. Quick, accurate advice by an actual human. But that seems gone as well now?\\n\\nI spend ages looking through their confusing [new website](https://www.glasgow.gov.uk/article/1544/Contact-Us) and the [MyGlasgowCC App](https://www.glasgow.gov.uk/MyGlasgowCC) they constantly redirect you to, and while I see Live Chat mentioned in various places there is no way I can find to start it. Used to be that (on a computer) the website would just have the live chat button on the bottom left of the screen, but now it's gone or extremely well hidden.\\n\\nAm I just being a moron? Does anyone have better ways to contact them with questions about Council Tax?\", \"author\": \"RGodlike\", \"timestamp\": \"2025-08-25T10:44:03.280817\"}",
    "1mznjxr": "{\"text\": \"Pizza Hut suddenly closes down well-known Glasgow venue \", \"author\": \"ReligiousClam\", \"timestamp\": \"2025-08-25T11:14:55.081108\"}",
    "1mzoyq0": "{\"text\": \"How\\u2019s this possible? With the number of roadworks in Glasgow alone how is it that this company could go bust?\\n\\nTraffic management firm ceases trading with loss of 119 jobs https://www.bbc.com/news/articles/c9qy37p0l18o\", \"author\": \"MHR1980\", \"timestamp\": \"2025-08-25T12:35:39.956932\"}",
    "1mzomfx": "{\"text\": \"Cheese board/platter recommendations around Glasgow I'm looking for any places that do them this weekend. I'm craving one and wanna treat myself after payday\", \"author\": \"Inner_Collection4486\", \"timestamp\": \"2025-08-25T12:35:40.094282\"}",
    "1mzq9su": "{\"text\": \"Restaurant in front of flat building keeps desposing of their trash in our garbage cans. What can we do? Self-explanatory title. They keep throwing their garbage in our trash cans to the point where we don't have space for our domestic trash. They overfill them to the point where we the residents keep getting in trouble with the Council and the local trash disposal team; the trash just started surrounding our flat building and it's getting pretty disgusting.\\n\\nAny tips? Who can I call?\", \"author\": \"LittleSadPluto\", \"timestamp\": \"2025-08-25T13:19:35.383690\"}",
    "1mzq8z1": "{\"text\": \"Nothing, Nowhere in Glasgow - what's the vibe like (going solo!) Just grabbed a ticket for Nothing, Nowhere in Glasgow! I actually had a ticket for the Prague show that got canceled because of the pandemic, so this is kind of a dream come true for me.\\n\\nFlying in from Sweden, so it\\u2019s a bit of a trip. I used to spend a lot of time in Edinburgh between 2013 and 2018 (haven\\u2019t been back since), so it\\u2019ll be a nice little reunion with Scotland too.\\n\\nOnly issue (besides having zero clue what outfit to wear lol) is that I\\u2019m going solo.\\n\\nAnyone here gone to a Nothing, Nowhere show alone before? What\\u2019s the vibe like? Easy to meet people and hang out? What kind of crowd usually shows up? I\\u2019m a woman in my 30s if that matters.\\n\\nNot scared of a moshpit, and definitely planning to push for front row if I can!\\n\\nAnd hey, if anyone else here is going to the Glasgow show\\u2026 pls adopt me. I jump and dance harder now than I ever did in my 20s, scream every lyric like my life depends on it, and I genuinely don\\u2019t care about age (my friends range from 20 to 60). Basically: I\\u2019ll be your chaotic concert buddy, hype you up, and probably lose my voice in the process. \\ud83d\\ude05\", \"author\": \"KawaiiMom1\", \"timestamp\": \"2025-08-25T13:19:35.441528\"}",
    "1mzqqfz": "{\"text\": \"New venue proposed for Hyndland parish church. \\nhttps://publicaccess.glasgow.gov.uk/online-applications/applicationDetails.do?activeTab=makeComment&keyVal=SZ1036EXKNX00\\n\\nNew jazz and folk venue proposed.\\n\\nLots of docs on the council website.\\n\", \"author\": \"xxx654\", \"timestamp\": \"2025-08-25T13:46:45.811075\"}",
    "1mzqcg6": "{\"text\": \"Would You Like To See This In Glasgow? Would you be keen to try this if it were available in the shops in Glasgow? \\n\\nWhilst there are other breweries out there who do an \\\"Irn Bru\\\" style sour beer this brewery based in Dundee by the name of LAW Brewing were the OG of this beer before the other bigger breweries came on board. \\n\\nI'm happy to get this into places if anyone is keen? \\n\\nJust say where is a local shop and I'll look to chat with the boss of the shop. \\n\\nCheers \\ud83c\\udf7b\", \"author\": \"Emily_Green_\", \"timestamp\": \"2025-08-25T13:46:45.920723\"}",
    "1mzrcno": "{\"text\": \"For all those interested in the Star Bar makeover, it doesn't seem like that much is going to be changed | The Bell (headline related to a different story in the briefing) \", \"author\": \"Historical_Sir5263\", \"timestamp\": \"2025-08-25T14:17:39.459766\"}",
    "1mzt8as": "{\"text\": \"How unsafe is glasgow, really? Hi everyone, I\\u2019m going to be in Glasgow for a really short time for a course at UofG but I\\u2019ve been hearing a lot of things especially on reddit. Is it really unsafe or are the rumors exaggerated? Especially considering I\\u2019m a single girl not from the UK going to live alone. I also wanted to hear your opinions about where to live, I have two options one in Kinning park/Paisley road and the other is less expensive and near Yate street close to celtic park. I couldn\\u2019t find anything suitable in the city center. Anyway, please let me know what you guys think and which area do you recommend and is safer.\", \"author\": \"TulipML\", \"timestamp\": \"2025-08-25T15:18:10.480161\"}",
    "1mzt74o": "{\"text\": \"Thoughts on living in EK please? I'm thinking of buying a house in the Merlin Gardens Estate as it seems to have the retail park nearby and it's close enough to the train station, but I keep hearing that Jackton is the place to be - why? There's nothing nearby Jackton and looks to be very isolated.\\n\\nI'd buy in the Southside if I could afford it, but it's out of my budget now.\\n\\nHeard the weather can be awful in EK too, but unsure how true this is?\", \"author\": \"GlasgowPotato\", \"timestamp\": \"2025-08-25T15:18:10.591880\"}",
    "1mzu0q8": "{\"text\": \"Can anyone recommend a lawyer/solicitor? Hope this is allowed! Don't really want to go into it but I'm looking to claim for negligence and need recommendations. Preferably a firm you have had experience with! \\n\\nThanks \", \"author\": \"HylianPalian\", \"timestamp\": \"2025-08-25T15:51:36.192279\"}",
    "1mzuwhs": "{\"text\": \"Moving companies (and prices!) you used? Hi all, I'm considering getting a moving company to assist moving from one flat to another, both in G postcodes.\\n\\nI've seen a few moving company recommendations but wanted to ask again and ask for prices you paid. I'm not moving much stuff outside of boxes and a couple of chest of drawers so looking to go cheap as possible! \", \"author\": \"ResolutionHot3188\", \"timestamp\": \"2025-08-25T16:20:55.108594\"}",
    "1mzurkv": "{\"text\": \"Littlehill golf course Do people walk on? \\nWhen does starter box close? \\nIs the course well kept? \\nAny local knowledge that is good to know would be appreciated thanks\", \"author\": \"mattycranners\", \"timestamp\": \"2025-08-25T16:20:55.216479\"}",
    "1mzugzi": "{\"text\": \"6/7am Martial Arts classes Hi, does anyone know of any martial arts classes (Kickboxing, MT, BJJ, MMA) in Glasgow and surrounding area between 5-8?! \\n\\nTIA. \", \"author\": \"lostnov04\", \"timestamp\": \"2025-08-25T16:20:55.306200\"}",
    "1mzuare": "{\"text\": \"Can anyone recommend a more \\\"high end\\\" gym in Glasgow? Preferably city centre? I've been a member of Pure Gym for years, but I am looking for a more high end gym. I've tried the village and that is high end in price but the gym is fucking shit. \\n\\nI've tried different studios, and I know of the extreme gym, which i haven't tried. But I think that's something along the lines I'm looking for or the kilo club in St Andrews. \\n\\nIs there anything like that in the city? \", \"author\": \"Strict-Brick-5274\", \"timestamp\": \"2025-08-25T16:20:55.387696\"}",
    "1mzu8iw": "{\"text\": \"Silhouettes \", \"author\": \"naFteneT\", \"timestamp\": \"2025-08-25T16:20:55.491030\"}",
    "1mzvkkz": "{\"text\": \"East Kilbride Station embarks on a new era \", \"author\": \"mrjohnnymac18\", \"timestamp\": \"2025-08-25T16:46:58.049022\"}",
    "1mzvcla": "{\"text\": \"Parking permit renewal Anyone else had issues renewing their permits through the RingGo website? I\\u2019ve had the notification through to renew it but the website just isn\\u2019t letting me \\ud83e\\udd74\", \"author\": \"omnomnomdeplume94\", \"timestamp\": \"2025-08-25T16:46:58.112168\"}",
    "1mzwd5j": "{\"text\": \"Hello, don\\u2019t suppose anyone here knows what chemicals Glasgow CC use when they remove graffiti? I know they can use pressure washers and sand blasting for certain surfaces, but do they also use any washes or specific products to clean it off? Many thanks.\", \"author\": \"IStabAtThee_sorry\", \"timestamp\": \"2025-08-25T17:13:17.523770\"}",
    "1mzwuic": "{\"text\": \"Puppy Classes around Glasgow Hello! \\n\\nWe are looking for puppy classes in Glasgow and west of Glasgow, dumbarton-ish area too.\\n\\nWe had one but they had quite old methods, like flicking the dogs nose and pinning the puppy down etc, which we definitely didn't agree with.\\n\\nAny recommendations would be appreciated! \", \"author\": \"Tweeky91\", \"timestamp\": \"2025-08-25T17:31:14.043426\"}",
    "1mzwrlb": "{\"text\": \"Marks & Spencer Byres Road Closing Closes on 25th October. Pish.\", \"author\": \"Artemio_Germain\", \"timestamp\": \"2025-08-25T17:31:14.112948\"}",
    "1mzxakd": "{\"text\": \"Fire behind house of sher Just gone over Kingston bridge.  Good going  fire under the ski ramp exits, black smoke blowing  onto the carriageway \", \"author\": \"LowEnergy1169\", \"timestamp\": \"2025-08-25T17:49:44.604951\"}",
    "1mzx8hb": "{\"text\": \"Why are Scotrail so shitty and rude? Bought an off peak ticket on Trainline with a railcard, everything was legit and I've done it dozens of times before. Suddenly a conductor tells me my ticket's not valid and he should charge me \\u00a312 for a 4 min train journey that literally costs \\u00a32.20 return without a railcard. Asked why and he said you can't use your railcard before 10am as it's not off peak. Trainline literally says off peak day return for the time I travelled. Tried it on the Scotrail app and exactly the same thing comes up! Even says the railcard discount has been applied when I don't think it has or it would have stupidly boosted the price to \\u00a312, which it didn't. Also not Scotrail but Railcard - what is the logic of a railcard not being allowed for \\\"commuter trains\\\" unless you have a senior railcard!?!? So fucking stupid and the Glasgow staff were so jobsworthy and dismissive of the fact that the system is ridiculous I'm raging\", \"author\": \"Lopsided-Abalone-373\", \"timestamp\": \"2025-08-25T17:49:44.700134\"}",
    "1mzy320": "{\"text\": \"City of Glasgow College online lectures? I\\u2019m confused on my timetable for COGC\\n\\nI\\u2019ve been given the room allocations, but next them in brackets it says \\u201cteams\\u201d\\n\\nDoes that mean it\\u2019s online? Or is it group work?\", \"author\": \"Emmie-Emz\", \"timestamp\": \"2025-08-25T18:24:56.531033\"}",
    "1mzyw22": "{\"text\": \"Where is good on a Monday night? Hey heading into town tonight and want to know where is good on a Monday night? \", \"author\": \"Lilybillyxox\", \"timestamp\": \"2025-08-25T18:49:34.014948\"}",
    "1mzyidy": "{\"text\": \"Gtf ya Tory \\ud83d\\udd14end BBC News - Scottish Tory leader says asylum hotel protests 'understandable' - BBC News\\nhttps://www.bbc.co.uk/news/articles/c4gzyd727x2o\", \"author\": \"kaluna99\", \"timestamp\": \"2025-08-25T18:49:34.071335\"}",
    "1mzzihf": "{\"text\": \"Glasgow airport parking discount Due to a very tight schedule I need to park in the multi story car park and get priority security for the airport. I\\u2019m sure I seen a parking discount code a few weeks back on the motorway flyover advertising board, does anyone remember the code? \", \"author\": \"WarmFlamingo9310\", \"timestamp\": \"2025-08-25T19:13:22.328438\"}",
    "1mzr3m5": "{\"text\": \"Civerinos gross Was working at civs till last feb, they had no grease trap and it was backed up with sewage. Prep chef decided that \\u2018he didn\\u2019t have the luxury of using any sink he likes\\u2019 in the prep kitchen, so purposefully flooded an un-drainable sink, which backed up into the grease trap, which backed up into sewage. Essentially, the prep kitchen was perpetually full of sewage. They fired me for being ill. Lol.\", \"author\": \"Bachquino\", \"timestamp\": \"2025-08-25T19:13:22.396064\"}",
    "1mzzvfr": "{\"text\": \"Has anyone installed outside bike storage for a residential flat? I\\u2019ve just bought a bike but it\\u2019s quite heavy and due to the layout of the stairwell and doors it\\u2019s quite tricky getting it in and out of my flat every time.\\n\\nI own my flat and have two assigned parking spaces (set out in the deeds) but I don\\u2019t have (or want) a car.\\n\\nHas anyone else in this situation installed outside storage for a bike? It would be great to install some kind of hanger/rack and I\\u2019d be happy for other residents to use it too. We\\u2019re set back from the road and there\\u2019s only a few flats.\\n\\nThe flats are factored - I have no idea where to start with this, is it something I can just do since I own the flat and the parking space or is it something I have to ask the factors about?\\n\\n\", \"author\": \"ilovescones\", \"timestamp\": \"2025-08-25T19:27:10.647788\"}",
    "1n008fh": "{\"text\": \"What is this tower thing(M74) Seen this get put up a few months ago, anyone any idea what it is? I was thinking some emissions monitor but it's a bit over the top for that I think \\ud83e\\udd14\", \"author\": \"Typical_Rip_1818\", \"timestamp\": \"2025-08-25T19:38:15.793260\"}",
    "1n01wel": "{\"text\": \"121 Spanish Tutor Anyone know of any 121 private Spanish tutors for adult learners in Glasgow? cheers :) \", \"author\": \"lapsedflutephobe\", \"timestamp\": \"2025-08-25T20:40:32.467853\"}",
    "1n028qo": "{\"text\": \"Loft flooring/storage in Glasgow and surrounding areas Hi folks,\\n\\nI\\u2019m looking to get my loft partially floored and some basic storage solutions put in (nothing fancy, just safe and practical). I\\u2019d like to hear if anyone has had good experiences with companies in or around Glasgow that do this kind of work.\\n\\nMain things I\\u2019m after:\\n\\n* A reputable company/tradesperson (ideally someone you\\u2019ve used yourself)\\n* An indication of what a realistic and fair price would be - don\\u2019t want to get ripped off\\n* Good quality work and reliability\\n* Ladder isn't necessary, but if the cost isn't a huge difference, would definitely consider including it\\n\\nAppreciate the cost one might be hard to answer, as it'll depend on a few factors, I know. If it helps, the space would be around 2.7m width, 3.6m length (for the main bit - it is bigger but I don't think I need under the water tank etc floored)  \\n  \\nI've been hit with about 400 ads on FB/Instagram/Google since clicking on one, but all have quite mixed reviews and small numbers of reviews, so not sure how good a representation they are. \\n\\nIf you\\u2019ve had loft flooring/storage done recently, who did you go with, and would you recommend them? Any ballpark idea of costs would be super helpful too.\\n\\nCheers!\", \"author\": \"Sure_Debate_7646\", \"timestamp\": \"2025-08-25T20:50:41.178665\"}",
    "1n07y1x": "{\"text\": \"Quit smoking and I've got 50g bags of amber leaf to get rid of I have recently quit smoking and I'm hoping to get rid of 50g pouches of amber leaf. Currently going for 43.35 at Tesco. Anyone keen on buying for \\u00a330? \\n\\nHoping to get it gone asap so I dont have temptation, so ideally selling multiple pouches at once. Any interest? \\n\\nBased near Sauchiehall so could meet at the Gregg's there. Dm me\", \"author\": \"NipFiend\", \"timestamp\": \"2025-08-26T01:18:58.253331\"}",
    "1n0c54v": "{\"text\": \"Long term park and ride? Hey everyone,\\nI\\u2019m flying to Greece for a week and driving in from Aberdeen to fly out of GLA. When I fly out of Edinburgh I usually park at the Halbeath park and ride which is free with no limit on length of stay. Is there anything around Glasgow that offers similar and from where I could get a bus or train to the airport or into town? \", \"author\": \"Tessab87\", \"timestamp\": \"2025-08-26T04:30:32.147641\"}",
    "1n0d084": "{\"text\": \"The Steamie - Tuesday 26 August 2025 **Travel**\\n\\nNo line problems reported.\\n\\n**Today in Scottish History**\\n\\n26 August 1745: The birth in Edinburgh of  Henry Mackenzie,  a novelist  and leading member of the Edinburgh literary  scene in the decades either side of 1800.\\n\\n**/r/GlasgowMarket Digest**\\n\\n[Stride Athletics Urban Orienteering - Wednesday 27 August](/r/glasgowmarket/comments/1mz67vt/stride_athletics_urban_orienteering_wednesday_27/)\\n\\n[Books for sale](/r/glasgowmarket/comments/1myqtdz/books_for_sale/)\\n\\n[Anyone selling 2-3 esdee kid tickets for the 19th, can pay abit above also must provide legit proof of the tickets!](/r/glasgowmarket/comments/1mxbj1u/anyone_selling_23_esdee_kid_tickets_for_the_19th/)\\n\\n[2 VIP Tickets to Beluga Lagoon in Kelso with VIP Parking pass](/r/glasgowmarket/comments/1mwt3h0/2_vip_tickets_to_beluga_lagoon_in_kelso_with_vip/)\\n\\n[Looking for Alchemised Signing Ticket in Glasgow](/r/glasgowmarket/comments/1muiuig/looking_for_alchemised_signing_ticket_in_glasgow/)\\n\\n[New mechanic business Glasgow](/r/glasgowmarket/comments/1muipkp/new_mechanic_business_glasgow/)\\n\\n[boozy brunch tickets for sale](/r/glasgowmarket/comments/1muegll/boozy_brunch_tickets_for_sale/)\\n\\n**Tune of the day**\\n\\n[Billy & Chuck - \\\"You Look So Good to Me\\\"](https://youtu.be/zD3pYtnKxo4) (suggested by /u/MickIAC) \\n\\nPicked from 3 eligible links submitted today. [Suggest tomorrow's tune](https://www.reddit.com/message/compose/?to=SteamieBot&subject=SongRequest&message=YouTube link here).\", \"author\": \"SteamieBot\", \"timestamp\": \"2025-08-26T05:17:19.127287\"}",
    "1n0dqpw": "{\"text\": \"Garden Waste Bin Permits I know this one is a pain in the arse but has anyone been able to buy a bin permit for the coming year?\\n\\n  \\nEach time I try I get a pop up telling me to click on a link to resolve the issue and there is no link.\\n\\n  \\nNot like the money grabbing so and so's at the council not wanting to take peoples money.\", \"author\": \"icono_76\", \"timestamp\": \"2025-08-26T05:51:17.242809\"}",
    "1n0eewn": "{\"text\": \"Long term parking at Glasgow airport The yellow highlighted road is free parking, but good luck getting a space there (just don't block the bus stop or encroach into the side roads). I usually end up parking somewhere in the green area and have a 10-15 walk to the terminal. Much better than paying 55 quid and your liver for ten minutes\", \"author\": \"Illustrious-Welder84\", \"timestamp\": \"2025-08-26T06:51:50.309840\"}",
    "1n0fmes": "{\"text\": \"Scotland flags Anyone know anything about all the Scotland flags on Balmoral Road? It looks like it\\u2019s been put up with zip ties\\u2026so I don\\u2019t think it\\u2019s the council that\\u2019s done it. It\\u2019s literally on every lamp post. Or is this someone channeling their inner William Wallace to let everyone know this is Scotland and we don\\u2019t want Palestine flags etc\", \"author\": \"AA1204\", \"timestamp\": \"2025-08-26T07:49:47.800520\"}",
    "1n0g00r": "{\"text\": \"Plans approved to build more than 1700 homes in this area of Glasgow \", \"author\": \"LordAnubis12\", \"timestamp\": \"2025-08-26T08:24:17.008866\"}",
    "1n0fy5w": "{\"text\": \"Electricity points ? Hey does anyone know if there is any electrical point you can use in Glasgow . I need to wet vac my car but I live in a top floor flat. Does this thing even exist ?\", \"author\": \"NicolaiStrelitzia\", \"timestamp\": \"2025-08-26T08:24:17.077551\"}",
    "1n0h8d9": "{\"text\": \"Spider man film sets? Hello, Im here visiting a friend and stumbled upon all this on my walk. Are these the last bits of set from the new Spider Man film? \", \"author\": \"melsmilkyway\", \"timestamp\": \"2025-08-26T09:42:08.714416\"}",
    "1n0hl05": "{\"text\": \"Print & Embroidery Service in or around Glasgow? Apologies if wrong forum.\\n\\nLooking to find a print & embroidery service in the area that allows the customer to provide the garments? All that I\\u2019ve came across don\\u2019t allow this, so looking to see if any one has local business recommendations that caters for this!\\n\\n\", \"author\": \"Live-Response-220\", \"timestamp\": \"2025-08-26T10:18:23.814689\"}",
    "1n0ibt0": "{\"text\": \"Wood flooring recommendations Looking for recommendations on where to shop for wood flooring and who to use to lay it down. The Mrs likes the look of herringbone wood flooring and I can see it can get expensive per square foot. Any recommendations would be appreciated! Thanks! \", \"author\": \"Staunch-Beef\", \"timestamp\": \"2025-08-26T10:44:04.857074\"}",
    "1n0i8i0": "{\"text\": \"Anyone know what\\u2019s happening in Kent Road/Cleveland Street? I haven\\u2019t been able to get a good look (live nearish) but there\\u2019s screens up, minibuses, lighting etc. Around the pub on the corner of Kent Road/Cleveland Street. \\n\\nChecked the council\\u2019s website but there\\u2019s no notice about filming etc. \\n\\nThey\\u2019ve filmed a few shows and adverts around here before. Anyone have more info? (I\\u2019m just being nosey!)  \", \"author\": \"PurpleAutisticPiplup\", \"timestamp\": \"2025-08-26T10:44:04.988340\"}",
    "1n0i2fr": "{\"text\": \"Ticket for King Tut's Summer Nights on the 29th Ticket for this night: [https://www.ticketweb.uk/event/heavy-weather-heavyskint-king-tuts-wah-wah-hut-tickets/14473593](https://www.ticketweb.uk/event/heavy-weather-heavyskint-king-tuts-wah-wah-hut-tickets/14473593)\\n\\nWill sell cheaper than the online price on ticketweb.\\n\\nJust selling because I can't attend anymore!\", \"author\": \"BigBooksLilReads\", \"timestamp\": \"2025-08-26T10:44:06.384275\"}",
    "1n0h4uc": "{\"text\": \"Cafe with haggis Looking for a cafe/roll shop near Finnieston that has haggis rather than black pudding. Been to quite a few options and none of them seem to offer.\", \"author\": \"Constant-Fondant9058\", \"timestamp\": \"2025-08-26T10:54:02.882851\"}",
    "1n0irpj": "{\"text\": \"The National on Instagram: \\\"Watch as screenwriter Paul Laverty is arrested in Edinburgh in support of Palestine Action \\ud83d\\udea8 Laverty, whose films have twice won the Palme d\\u2019Or, was lifted by police in Edinburgh on Monday for allegedly supporting the proscribed group Palestine Action #palestine #edinb This is disgusting. Screenwriter Paul Laverty (who was a humanitarian lawyer in Mexico before he became a writer for so many Ken Loach movies) was arrested for wearing a T-shirt. Looks like Edinburgh. He has a right to know what he was being arrested for. This police Scotland gestapo crap needs to stop.i don't care if they are following government orders, if it's wrong they should be clapping back. They are just complicit. Scotland, this is not who we are.\\n\", \"author\": \"Significant-Luck-831\", \"timestamp\": \"2025-08-26T11:15:32.026116\"}",
    "1n0ilgg": "{\"text\": \"Abandoned construction in/around Glasgow I stumbled on what I thought was an abandoned half-constructed house on my run yesterday. (Turns out, the folks are still working on it... just very slowly.) It got me thinking about whether there are other projects that have ground to a halt in/around Glasgow.\", \"author\": \"TheMeanderer\", \"timestamp\": \"2025-08-26T11:15:32.157143\"}",
    "1n0jca7": "{\"text\": \"Quiz Nights Anyone know of anywhere in central Glasgow that hosts quiz nights on either a Wednesday or Thursday? \", \"author\": \"Princ3ssP3ach321\", \"timestamp\": \"2025-08-26T11:37:46.776196\"}",
    "1n0k1bo": "{\"text\": \"Ancient Celtic carnyx. \", \"author\": \"Banzay_87\", \"timestamp\": \"2025-08-26T12:37:09.297786\"}",
    "1n0llne": "{\"text\": \"cyclists of glasgow ive just got a new bike, and want to make the most of it. whats your go to park or cycle spot in the city that you recommend?\", \"author\": \"DueCoach4764\", \"timestamp\": \"2025-08-26T13:20:54.917360\"}",
    "1n0l38g": "{\"text\": \"Chappel roan Have one chappel roan ticket for tonight in edinburgh. Resale not available on Ticketmaster so would need to do a transfer. Looking for \\u00a375\", \"author\": \"TuneAffectionate9774\", \"timestamp\": \"2025-08-26T13:20:56.381517\"}",
    "1n0n13e": "{\"text\": \"Cheap tickets at Renfrew Cineworld? I just booked tickets for 'Weapons' this Saturday via their website and paid \\u00a34 per ticket?? And I wasn't charged the usual \\u00a31pp booking fee? Is this because it's closing down next month? Wild!\", \"author\": \"lilbobpie\", \"timestamp\": \"2025-08-26T14:16:10.481852\"}",
    "1n0n6qr": "{\"text\": \"Today in Partick Morrisons! Four salmon heads for \\u00a32.47. Dozens of them.\", \"author\": \"Artemio_Germain\", \"timestamp\": \"2025-08-26T14:41:37.146653\"}",
    "1n0j92s": "{\"text\": \"Therapist recommendations Looking for recommendations for therapist (must be accredited/degree level). Specifically looking for someone who deals with possible neurodivergence, childhood trauma, anxiety, and low self esteem and shame. Thanks \", \"author\": \"Numerous-Plant5399\", \"timestamp\": \"2025-08-26T16:45:23.936976\"}",
    "1n0s7c5": "{\"text\": \"PSA: Cults in Glasgow Please beware of 'Light Family' style cults operating in Glasgow\\n\\nThey are sexually abusive cults involved in child abuse and human trafficking fronting as health, wellbeing, yoga, sports, holistic groups, charities and more.\\n\\nCandles, Robes, \\\"spells\\\", brainwashing. Most of what you would think of when you think of a stereotypical cult only more horrifying that you can understand.\\n\\nThank you for your attention to this matter,\\n\\nSincerely,\\n\\n~~Protector of the Light~~  \\nSanta x\", \"author\": \"Human-Garbage-Person\", \"timestamp\": \"2025-08-26T17:49:25.003399\"}",
    "1n0sxgl": "{\"text\": \"Glasgow scenic train? I along with my family will be reaching Glasgow tomrw from London and we have not planned anything as it was a last minute decision. We have our 4 year old daughter also. We don\\u2019t want to just stay in city, would like to explore more as in traveling further up via train or bus. Would appreciate suggestions on scenic train rides that we check or is there anything else that we can do if train tickets are not available. Thank you in advance.\", \"author\": \"appleplus_2845\", \"timestamp\": \"2025-08-26T18:23:14.370043\"}",
    "1n0sx4c": "{\"text\": \"Volunteering advice at some animal shelter Hi all, my birthday is coming up in a few days, and I was wondering if there\\u2019s an animal shelter where I could spend a few hours volunteering and spending time with animals. I tried searching online but couldn\\u2019t find many good options. I\\u2019d really appreciate it if you could suggest some places.\", \"author\": \"External_Nobody6793\", \"timestamp\": \"2025-08-26T18:23:14.448798\"}",
    "1n0uv0l": "{\"text\": \"Glasgow drivers are something else. To the absolute turd in the red corsa that sped and swerved at me while crossing the road on great western, enjoy your driving ban. You did it under a traffic camera, you genius. \", \"author\": \"Zestyclose-Piece-662\", \"timestamp\": \"2025-08-26T19:13:05.871074\"}",
    "1n0t4jl": "{\"text\": \"Will Glaswegians ever learn not to be anti-social manky rats Walking around the new uni bit which is not even fully built yet and there  are bins every 10 yards\\n\\nThere's still litter strewn about everywhere and smashed glass.\\n\\nI don't know why Glaswegians enjoy making things unpleasant as possible but do you think they will ever learn not to take a poop in their front room? \", \"author\": \"Blind_WillieJ\", \"timestamp\": \"2025-08-26T19:13:06.000458\"}",
    "1n0ug5z": "{\"text\": \"Advice buying furniture I'm in the market for a new lounge suite and I've seen a couple at Jupiter in Clydebank that I fancy.  There are very few reviews of them online and the staff seem to avoid you in the shop which feels a wee bit dodgy. \\n\\n  \\nHas anyone bought from them and, if so, do you recommend them? \", \"author\": \"anneka1998\", \"timestamp\": \"2025-08-26T19:13:06.131285\"}",
    "1n0v8w1": "{\"text\": \"Hair and make up recommendations Looking for some personal recommendations for salon that does both hair and make up on a Thursday morning as we are attending a wedding . Preferred area Glasgow south side / Barrhead/ Paisley however happy to travel if needed.  Please help  a girl out as I don\\u2019t want to end up looking like a \\ud83e\\udd21 \\ud83e\\udd23\", \"author\": \"SomewhereNeither5816\", \"timestamp\": \"2025-08-26T19:25:54.637984\"}",
    "1n0vmvb": "{\"text\": \"Question for hospitality folks Been working in a Glasgow restaurant for a year now and have seen the decline of customers fall at some rate recently, it\\u2019s now very quiet through the week and not even that busy at weekends, just wondering if it\\u2019s all restaurants feeling like this or if mine is just dying off, cheers! \", \"author\": \"Worldly_Hippo9963\", \"timestamp\": \"2025-08-26T19:49:52.303319\"}",
    "1n0vm2s": "{\"text\": \"Library private rooms as foreigner Hey there :)\\nI'm planning on doing a trip to Glasgow early October. However I'll need to have an important remote study meeting (roughly 3 hours) on the day of my departure - so I can't attend it from my hotel.\\nI've read that there are private rooms to study with WiFi in libraries, like the Mitchell Library.\\nIs it possible for a foreigner to book one of these? \\n\\nAnd if not, is there any other recommendation you have somewhere near the city center that is not too expensive and as quiet as possible? :)\\n\\nThank you all in advance! And sorry if this question isn't supposed to be part of the main subreddit :x\", \"author\": \"Salty_MuskOx\", \"timestamp\": \"2025-08-26T19:49:52.401586\"}",
    "1n0w452": "{\"text\": \"Looking for beginner dance classes in Glasgow i.e. Salsa, Bachata, or West Coast Swing. Hey folks,\\n \\nI (26m) and my gf (28fm) like to dance. She has a soft spot for Latin dance \\u2014 Salsa, Bachata, maybe even West Coast Swing \\u2014 and I\\u2019m keen to dip my toes in with her. We\\u2019re not necessarily looking for a long-term commitment (to the classes, I mean \\ud83d\\ude05), just something fun and beginner-friendly to try out together.\\n\\nWednesday nights would be ideal, but if the vibes right, we\\u2019re open to other evenings. We\\u2019re hoping for something low-pressure, welcoming to newcomers, and ideally with a social element. Weekends would also be nice if we could get a drink before and/or afterwards.\\n\\nWe\\u2019ve got no idea where to start \\u2014 any recommendations for studios, community groups, or hidden gems around Glasgow? Would love to hear what\\u2019s worked for you or what to avoid. \\n\\nCheers!\", \"author\": \"KinglyBling\", \"timestamp\": \"2025-08-26T20:18:20.288772\"}",
    "1n0w3c3": "{\"text\": \"Hairdresser recommendation Looking for recommendations for hairdressers in the West End or Central that specialise in balayage? Having a nightmare finding somewhere that does a blended balayage and not just highlights with a root painted on. Any reccs welcome \\ud83d\\ude4f\\ud83c\\udffb \", \"author\": \"Vanilla_Sun_2312\", \"timestamp\": \"2025-08-26T20:18:20.350867\"}",
    "1n0xg86": "{\"text\": \"Bots Sub seems to have been swamped by racist comments from bots. No posts or comments on the profile. \\n\\nThat's not us. \", \"author\": \"kaluna99\", \"timestamp\": \"2025-08-26T20:49:57.847917\"}",
    "1n0yt00": "{\"text\": \"Swedish firm set to take over Glasgow\\u2019s hire bikes \", \"author\": \"tman612\", \"timestamp\": \"2025-08-26T21:49:35.831630\"}",
    "1n11e4h": "{\"text\": \"6 aside team wanted Hey guys any one know of any 6 aside teams in a competitive league that need a player ? \\n\\nLooking to find a team to play for. \\nThanks\\n\\nIm decent played at a good level for past 6/7 years. Stopped only recently due to injury and moved from Derbyshire to Glasgow. \", \"author\": \"Ramsfan0123\", \"timestamp\": \"2025-08-26T23:40:51.410307\"}",
    "1n17ux3": "{\"text\": \"How many of yous are missing the PH from the 4 corners? And I don't mean PornHub. Sure both comes with speciality crust but really? I've never been inside to be honest. 20 quid for a pizza you can get for 3 frozen never seemed like a good idea.\\n\\nThe mingy Blue Lagoon seems like a good alternative if you ask the guy to put the gloves on after he handles the cash\", \"author\": \"dead-cat\", \"timestamp\": \"2025-08-27T04:52:21.390444\"}",
    "1n185gk": "{\"text\": \"The Steamie - Wednesday 27 August 2025 **Travel**\\n\\nNo line problems reported.\\n\\n**Today in Scottish History**\\n\\n27 August 1788: The trial begins in Edinburgh   of Deacon William Brodie, pillar of society and notorious criminal.\\n\\n**/r/GlasgowMarket Digest**\\n\\n[Chappel roan](/r/glasgowmarket/comments/1n0l38g/chappel_roan/)\\n\\n[Ticket for King Tut's Summer Nights on the 29th](/r/glasgowmarket/comments/1n0i2fr/ticket_for_king_tuts_summer_nights_on_the_29th/)\\n\\n[Stride Athletics Urban Orienteering - Wednesday 27 August](/r/glasgowmarket/comments/1mz67vt/stride_athletics_urban_orienteering_wednesday_27/)\\n\\n[Books for sale](/r/glasgowmarket/comments/1myqtdz/books_for_sale/)\\n\\n[Anyone selling 2-3 esdee kid tickets for the 19th, can pay abit above also must provide legit proof of the tickets!](/r/glasgowmarket/comments/1mxbj1u/anyone_selling_23_esdee_kid_tickets_for_the_19th/)\\n\\n[2 VIP Tickets to Beluga Lagoon in Kelso with VIP Parking pass](/r/glasgowmarket/comments/1mwt3h0/2_vip_tickets_to_beluga_lagoon_in_kelso_with_vip/)\\n\\n**Tune of the day**\\n\\n[Hypocritical](https://youtu.be/_JIlOQbhE9s) (suggested by /u/Queasy-Ice-2575) \\n\\nOnly one eligible link submitted today. [Suggest tomorrow's tune](https://www.reddit.com/message/compose/?to=SteamieBot&subject=SongRequest&message=YouTube link here).\", \"author\": \"SteamieBot\", \"timestamp\": \"2025-08-27T05:16:01.769230\"}",
    "1n19oub": "{\"text\": \"Anyone know where i can hand in old glasses to be recycled? I checked online and it looked like Specsavers and Vision Express did this but it seems that both have stopped doing so. Cheers. \", \"author\": \"Ok-Theory9508\", \"timestamp\": \"2025-08-27T06:47:37.657790\"}",
    "1n1ahen": "{\"text\": \"Central Glasgow Could Be Poised for a Revival \", \"author\": \"LordAnubis12\", \"timestamp\": \"2025-08-27T07:37:02.657017\"}",
    "1n1bufn": "{\"text\": \"Spider-Man photos from 10 August Hi! May be a bit of a weird request, but does anyone have any good shots of the Spider-Man filming from August 10 that you wouldn't mind me printing out (basically just to keep as a memento)? I wasn't able to get any non-blurry photos myself, and all the images I can find online are either compressed or have gigantic watermarks across them.\", \"author\": \"Nebula1253\", \"timestamp\": \"2025-08-27T09:17:42.424272\"}",
    "1n1brft": "{\"text\": \"Sofia Isella Glasgow (28/08/25) Got 2 tickets to Sofia Isella for sale in Glasgow for 28/08/25.\\n\\n  \\nSale via Ticketmaster only, to protect both of us.\\n\\nConcert: [https://www.ticketmaster.co.uk/sofia-isella-tickets/artist/5432666](https://www.ticketmaster.co.uk/sofia-isella-tickets/artist/5432666)  \\nListing: [https://secure.ticketmaster.co.uk/rs/360062B0A11A16C3/l6dqzlgzqh](https://secure.ticketmaster.co.uk/rs/360062B0A11A16C3/l6dqzlgzqh)\", \"author\": \"Emilw03\", \"timestamp\": \"2025-08-27T09:17:43.379178\"}",
    "1n1ciz4": "{\"text\": \"Chappell roan - travel back help Anyone that went last night have any insight of getting back from summer sessions, I've tried looking at happy bus and lothian buses but won't let me book, and I imagine the train would be hell trying to get in from, what did people do? First time heading to a gig in edinbrugh from Glasgow, and don't drive so any public transport options would be greatly helpful, thanks \\ud83d\\ude4f\", \"author\": \"007dermot700\", \"timestamp\": \"2025-08-27T09:49:44.572638\"}",
    "1n1czf0": "{\"text\": \"Where do you get your local news? I am spending too much time on Reddit. Hi folks. I think I spend a bit too much time on Reddit and I've realised a lot of what I use it for is to get a sense of what's going on locally. But it's def time to cut back, and in light of what another poster has said, I'm a bit concerned about the number of bots and people hellbent on stirring up shite everywhere (not just on Glasgow reddit). My question is how are folks getting their local news these days? \\n\\nThere's BBC news website of course but it's pretty slim pickings. I know of the Bell, and the Ferret. I also get the Glasgow Wrap and so feel I am looped into the Glasgow Times and Herald that way (e.g. what's decent from the papers will find its way to me eventually). What else though? Are there local social media journos/Youtubers that aren't whackjobs that you guys know of?\", \"author\": \"Teuchter121\", \"timestamp\": \"2025-08-27T10:16:59.298785\"}",
    "1n1cxrq": "{\"text\": \"What can I do if my GP is completely useless My GP appears to be completely incapable of sending prescriptions to pharmacies (by post, so it already takes like 4 days) and is quite happy to just have them sitting in the practise for over a week without bothering to contact me if there's an issue.\\n\\nIs there anything I can do to get prescriptions more smoothly? I am tired of having to chase the GP practise at least once a month for essential meds bc they can't be bothered\", \"author\": \"Skylark010\", \"timestamp\": \"2025-08-27T10:16:59.390788\"}",
    "1n13i10": "{\"text\": \"Glasgow buses Hello Glasgow peoples I just moved to Glasgow this month after living in London for 20 years and woow im really happy and excited I finally moved here and regretted not moving sooner years ago .. I love everything about the city and its peoples but my only questions is why the public Transport Buses so expensives and confusing ? In London you pay \\u00a31.75 to take as much buses as you want in 1 hours or pay \\u00a35.25 for a daily buses around the whole London but here last week Friday I pay a weekly pass for \\u00a323 (First Bus) and travel from my house in Dalmarnock to city centre and when I tried take another bus ( McGill ) to SEC & HYDRO my bus pass not working and driver told me to pay another \\u00a33.10 I was very confused but don\\u2019t want to argue I pay and again yesterday I took the 90 to Queen Elizabeth hospital and after 10pm going to Back to my house in Dalmarnock there was nomore bus 90 so I decided to take the 190 to Parkhead and walk to Dalmarnock and when I got on the bus the driver told me my weekly pass first bus ticket don\\u2019t work on this bus and I end up taking Glasgo cars taxi home because no bus 90 was coming \\u2026 it\\u2019s so frustrating having a weekly bus pass and still having to pay extra money to take others buses in Glasgow and also after 10pm it\\u2019s very difficult to get public transport home but apart from that I\\u2019m really enjoying the city and love Playing football at Toryglen outside pitches lool \\ud83d\\ude02\\ud83c\\udff4\\udb40\\udc67\\udb40\\udc62\\udb40\\udc73\\udb40\\udc63\\udb40\\udc74\\udb40\\udc7f\\u2763\\ufe0f\", \"author\": \"Ready-Negotiation949\", \"timestamp\": \"2025-08-27T10:16:59.485815\"}",
    "1n0z34x": "{\"text\": \"Are there any artists open to commission? This is a rlly goofy idea but I wanted to buy a reg charity shop landscape painting then try commission someone to paint some of my fav pokemon onto the painting as if they were always there in the original peice, any help here would be great thanks!\", \"author\": \"Active_Direction_209\", \"timestamp\": \"2025-08-27T10:41:08.655485\"}",
    "1n1e5r8": "{\"text\": \"Alternative wedding band recommendations Looking for recommendations for local-ish wedding bands that would play rock, punk, metal, pop punk, emo etc. We're getting married next August an hour north of Glasgow but there seems to be so many wedding bands to get through, thought I'd ask here for any people have used or seen that thought were great.\", \"author\": \"mashinater\", \"timestamp\": \"2025-08-27T11:27:34.889725\"}",
    "1n1eyf1": "{\"text\": \"Yorkhill and Cowcaddens Fire Stations due to be shut down. Due to budget cuts, these two fire stations which serve the city centre and west end of Glasgow are potentially going to be scrapped unless we do something about it.\\n\\n1. Read the article and click on the consultation link.\\n\\n2. Fill out the consultation for the \\\"Cowcaddens / Govan / Springburn / Yorkhill Maryhill\\\" section and say we need to keep BOTH stations.\\n\\n3. Share widely to your friends, family and neighbours, especially those who could be directly affected by these closures! \\n\\nIf there is enough outrage in decimating essential services to save a few \\u00a3\\u00a3\\u00a3, hopefully they will listen! \\n\\nThey definitely will shut them down if there's not a large enough response, so please take a few minutes and fill out the consultation by the 16th of September! \", \"author\": \"tortilla_avalanche\", \"timestamp\": \"2025-08-27T12:34:45.614330\"}",
    "1n1k8sf": "{\"text\": \"Schools Hi all, I\\u2019m new to Glasgow. Could anyone give me info on how some of the private schools differ in character etc. eg which are strongest for sport, academics, arts etc. \\nkelvinside academy, high school, Glasgow academy, hutchesons, Jordanhill (though I know it\\u2019s not private)\\n\\nThanks in advance\", \"author\": \"Helpful_Effective827\", \"timestamp\": \"2025-08-27T15:39:52.476279\"}",
    "1n1jx2x": "{\"text\": \"ScotRail - Can I get off on any stop along the way and continue my journey later Dad and I are visiting Glasgow and we want to go up to Loch Lomond tomorrow, but stop at Dumbarton on the way. Can I buy an off-peak ticket to Balloch and get off at Dumbarton, and then continue my journey to Balloch on the same ticket after we\\u2019re done in Dumbarton? Or do we need to buy Glasgow-Dumbarton and then Dumbarton-Balloch tickets?\\n\\n^(I swear there should be a Scottish Public Transit for Dummies book, the amount of time I\\u2019ve spent downloading various transit ticket apps and googling for answers is getting ridiculous)\", \"author\": \"Oh-My-God-Do-I-Try\", \"timestamp\": \"2025-08-27T15:39:52.556929\"}",
    "1n1l57a": "{\"text\": \"Got a call from jury court but didn't pick up I thought my jury citation started today but ended up starting yesterday and I got a phone call I wasn't able to pick up at work at 9am. Have I messed up?\", \"author\": \"Kallarimain1\", \"timestamp\": \"2025-08-27T16:20:22.675896\"}",
    "1n1kuyz": "{\"text\": \"Does anyone know why Dishoom is so popular? The queue extended off-camera. I've never tried it before. \", \"author\": \"Chanson_Riders\", \"timestamp\": \"2025-08-27T16:20:22.746507\"}",
    "1n1ltqt": "{\"text\": \"Glasgow Doors Open Days It may be be of interest to some folks\\n\\nThe Glasgow Doors Open Days (18 Sept - 21 Sept) are currently taking bookings (All free of Charge)\\n\\nIn fact a few have already been fully booked!\\n\\nIdeal days out for Families, Locals and Tourists \\n\\nhttps://glasgowdoorsopendays.org.uk/whats-on/\", \"author\": \"Secret-Star-9976\", \"timestamp\": \"2025-08-27T16:45:44.715876\"}",
    "1n1ls80": "{\"text\": \"Are schools not meant to be secure these days? Are schools in the UK secure, has this been something that couldn't happen at other schools due to them having higher security measures? \", \"author\": \"shake_N_bake9000\", \"timestamp\": \"2025-08-27T16:45:44.850332\"}",
    "1n1omp9": "{\"text\": \"Live music venues for under 12s Having been to a festival with us in the summer my son is really getting into music and wanting to see some live acts. I didn\\u2019t realise how hard it would be to find places where you can take kids.  Anyone got any suggestions? (I know you can take kids to hydro if you go to seats but didn\\u2019t want to have to spend \\u00a3\\u00a3\\u00a3\\u00a3 for him to be able to hear some bands) \", \"author\": \"NoAcanthocephala13\", \"timestamp\": \"2025-08-27T18:23:18.921151\"}",
    "1n1q4dm": "{\"text\": \"Help with exact location I got a fine for being in a bus lane and I\\u2019m trying to figure out where exactly they took the photo.\\nI\\u2019m not local to Glasgow as I was on holiday at the time.\\nThe pic was taken on the 12th August.\", \"author\": \"ThatSubaru88\", \"timestamp\": \"2025-08-27T19:13:57.231461\"}",
    "1n1qhbm": "{\"text\": \"Driving, PSA. I know that posts about the standards of driving here are common but this week I feel the need to reiterate some points to both Glasgow born van drivers, and newer Glaswegians on our roads, speaking purely as an emergency response driver and someone who's car was written off with my child in the car on Thursday by a weegie in a van, nice enough bloke but only had his licence back a year.....\\n\\nFilter lanes: if you need to make a right turn and enter a filter lane without a light on a major road, you wait until the oncoming lane is clear before you enter it. Especially if a vehicle is directly beside you and crossing the line to make progress before you commence your turn. Get off your fucking phone/open your eyes/wait that extra second vs deciding to ram into the side of a vehicle who has right of way who thought because you'd stopped on approach that you knew how to drive.\\n\\nVehicle size: Know your driving abilities. I see some absolute shambles with people in big motors hesitating with spaces a bus can get through blocking traffic, people who canni do a 3 point turn, reverse out a parking space etc. It's like driving in fucking Nairobi doing the school run these days and gives me palpitations. The dings on the cars tell their own story. If you aren't a confident driver, learn on a wee car like we all fucking did, and usually a banger for that very reason. I shouldn't see P plates on a range rover or an x5.\\n\\nFilter lanes MK2 for our international drivers etc: if you have 3 lanes and wish to enter the right hand lane to turn right, please join the queue to do so like everyone else. Do not proceed up the middle lane to go straight ahead then decide to turn right at the junction and proceed in front of other vehicles who are driving legally and almost causing a collision. If you decide to do so, do not then take umbrage at horns making you aware of other drivers positions and decide to stop completely further up the road to become an obstruction blocking them, waving your wee hands etc to have a tantrum. You may, one day come across the wrong person (or when theor child isnt in the car) who decides to get out and educate you in an aroused manner. \\n\\nFinal point: if you do indeed do both these things, do not then decide to pull over and allow the previously aroused but now calm driver to pass you so that you can tailgate them home in an intimidating manner for 10 minutes just because you've been beeped. When they get out of their car at the lights to speak to you with a wave and a smile (was genuinely only wanting to educate you on the filter lane to avoid you getting any more grief), the least you could do is remain as you are and take the helpful advice rather than turn in a dangerous manouvre and fuck off. If you're going to tailgate someone for 10 minutes it kinda gives the impression that you have something to discuss and abandoning the conversation just creates extreme disappointment when all the foreplay leads to nothing. This isn't Kabul and you aren't in an ambush. So stop driving like you are and have some manners. \\n\\nWho the fuck is teaching these people to drive? I can ignore most poor manouvres and ill judged decisions made with good intentions when a blue light is behind you (though that is also quite a straight forward thought process tbh) but when I'm in my own car I see some absolute lizard level driving. It has definately gotten worse in the last 5 years. I enjoy driving but there are some absolute mutants on the road atm!\\n\\nRant over. Driving instructors.....get a fucking grip please.\", \"author\": \"weegiecav\", \"timestamp\": \"2025-08-27T19:26:40.312377\"}",
    "1n1rzgm": "{\"text\": \"How is Halloween year? I live in Glasgow. And it has been a year since I\\u2019ve moved here. I 30 F am just wondering what the Halloween culture is like around here. Is it good for trick-or-treating? Do neighborhoods decorate their houses the way they do in the US? Are there a lot of kids in the neighborhood who go door-to-door or is it like a big party area or something?\\n\", \"author\": \"Sam2794\", \"timestamp\": \"2025-08-27T20:40:02.295098\"}",
    "1n1janb": "{\"text\": \"Friendly running clubs near Glasgow City Centre Any that you would recommend? I\\u2019m new to the city \", \"author\": \"FunRelative8069\", \"timestamp\": \"2025-08-27T20:40:03.666093\"}",
    "1n1t6ti": "{\"text\": \"Streetlights were out last night - Rutherglen Burnside area \", \"author\": \"Azuma_800\", \"timestamp\": \"2025-08-27T21:15:19.707322\"}",
    "1n1st1y": "{\"text\": \"Photographing Places on Glasgow Doors Open Days I'm trying to take a series of pics to celebrate Glasgow as a great, fun city. As an Edinburgher who lived in London for a while I need some help finding good places! Anyone seen the list of the coming Doors Open Days and see soemthing that might be really photogenic? I'm looking for anything fun, and it'd be great if it's something surprising andf not well known.\\n\\n[https://glasgowdoorsopendays.org.uk/whats-on/](https://glasgowdoorsopendays.org.uk/whats-on/)\", \"author\": \"muirvidler\", \"timestamp\": \"2025-08-27T21:36:17.022172\"}",
    "1n1uvh9": "{\"text\": \"Free roofing Insulation/New Roof, what\\u2019s the catch ? I live just outside Glasgow and live in a terraced house.\\n\\nHad a guy chap the door the night talking about a free brand new roof paid for by Octopus energy, claiming it\\u2019s to do with heat & energy certification and the money to fund it comes from Scottish government.\\n\\nI suppose it\\u2019s the sceptic in me but what\\u2019s the catch, nothing is ever completely free but he claims it is.\\n\\nTo be fair I have noticed in the past few weeks a good few houses a few streets away getting new roofs fitted and he claims company has done over 600 homes this year.\\n\\nWhat am I missing here ? \", \"author\": \"Illustrious-Dave\", \"timestamp\": \"2025-08-27T22:15:03.084598\"}",
    "1n1va8p": "{\"text\": \"I got provoked and attacked by two kids at McDonald\\u2019s They were probably only about ten years old, with no parents around, and swearing constantly. From the moment I walked in, sitting far away from me, they started making mocking, high-pitched noises at me to provoke me. I ignored them, though in my head I was already imagining punching them.\\n\\nThen suddenly something snapped against just below my eye, and I immediately knew it came from them. I walked over to their table, glared at them, and tried hard to hold myself back from hitting them. The ringleader put on an innocent face, while the other one apologized to me. Not wanting to cause more trouble, I went back to my seat. But a little later, the ringleader passed by me and once again made those mocking, squeaky noises.\\n\\nThis definitely wasn\\u2019t the first time they\\u2019d done something like this \\u2014 you could tell from how fearless they were. The reason they picked me was probably because I\\u2019m Asian and look like a teenager.\\n\\nLooking back now, it really scares me, that marble nearly hit me in the eye. With the force it had, I could have been blinded. I really regret not teaching them a lesson, or at least calling the police.\", \"author\": \"youwontknowme123\", \"timestamp\": \"2025-08-27T22:33:08.438028\"}",
    "1n24b8j": "{\"text\": \"Hidden gems? Coming up from Brighton to Glasgow for a wedding this weekend. I\\u2019ve been a few times before so would love to hear about your hidden gems off the beaten tourist tracks. Have free time Friday day/night, and all day Sunday. No kids, love decent scran, culture, pints and music. I see it\\u2019s raining all weekend too, so we\\u2019ve got some hours to fill. \\n\\nAny recommendations you can share to make this weekend even more memorable? TIA. \", \"author\": \"sowhatifitsathroaway\", \"timestamp\": \"2025-08-28T06:25:22.262008\"}",
    "1n26jc6": "{\"text\": \"In the City Festival - Traynor strikes again https://www.bbc.co.uk/news/articles/c30z40j121no\\n\\nAnyone else raging that Brian Traynor has once again fleeced people?   Anyone else affected by loss of ticket money.  \\n\\nThis is the same guy that allegedly runs Whistler on the Green..... Maybe go in for a nice meal and claim I've got no\\n\", \"author\": \"potholesaredarkholes\", \"timestamp\": \"2025-08-28T08:21:51.460714\"}",
    "1n268rh": "{\"text\": \"Cycling - anyone know a company either in Glasgow/Scotland (or UK generally) that does carbon fibre bicycle repairs? I've snapped my seatstay and looking for a local(ish) solution if possible!  \\n  \\n (would rather not have to post it if I can avoid) \\n\\nThanks :) \", \"author\": \"itsawunderbarlife\", \"timestamp\": \"2025-08-28T08:21:51.568996\"}",
    "1n26oz8": "{\"text\": \"Scott\\u2019s Bench location in Glasgow \", \"author\": \"ArtistAccurate2949\", \"timestamp\": \"2025-08-28T08:45:36.732619\"}",
    "1n27pds": "{\"text\": \"Anyone know what happened to the Thomas Hays Pet and Aquarium Corner? I\\u2019d been following the situation with that pet shop for a while after the allegations of animal neglect/abuse, and I\\u2019ve noticed that it now seems to have closed, and there are no animals or stock inside anymore. I\\u2019m a bit worried about what\\u2019s happened to the animals. Does anyone know if they were removed or rehoused? \", \"author\": \"Firm-Personality9895\", \"timestamp\": \"2025-08-28T09:39:34.252809\"}",
    "1n28ixf": "{\"text\": \"Robroyston: 'It was going to be a brilliant community but all we've got is houses' \", \"author\": \"mrjohnnymac18\", \"timestamp\": \"2025-08-28T10:42:24.679969\"}",
    "1n24gmj": "{\"text\": \"What the f*ck happened? \\\"7 per cent of the UK\\u2019s working-age people are on sickness benefits, in Glasgow it\\u2019s almost a third\\\"\\n\\n\", \"author\": \"HarleyMann3\", \"timestamp\": \"2025-08-28T11:13:31.823916\"}",
    "1n1r968": "{\"text\": \"Wine tasting in Glasgow? It's my dad's bday on Friday and I have been hunting the internet for a gift. I don't like buying physical gifts I always prefer taking him somewhere we can spend time together. I have been hunting for a week for something good to do with him some sort of wine tasting or gin tasting or something like that but I'm stuck and can't find anything good. Any suggestions? Can be Glasgow or edinburgh :)) \", \"author\": \"SadAcanthisitta1794\", \"timestamp\": \"2025-08-28T11:38:41.463652\"}",
    "1n29yu4": "{\"text\": \"recommend an Indian restaurant Mi madre wants Indian for her birthday (the food) so does anyone know a good place?\\nPreferably one where the madras isn\\u2019t sweet. I\\u2019ve had many madras\\u2019 and 8/10 of those have been sweet and I prefer spicy and more curry like than sweet and spicy vibe\\n\", \"author\": \"violetmacher\", \"timestamp\": \"2025-08-28T11:49:45.505444\"}",
    "1n2b05e": "{\"text\": \"24 hour parking outside of Lez Heading to Glasgow tomorrow from the North and need overnight parking outside of lez any recommendations??\", \"author\": \"harpokuntish\", \"timestamp\": \"2025-08-28T12:34:15.780543\"}",
    "1n2b7a6": "{\"text\": \"Re-fretting a guitar in Glasgow I'm looking to change my frets on my electric guitar. I've gotten quotes from Kenny Music and Jimmy Egypt and Sons for around \\u00a3300. Would appreciate if any musicians can share their experience getting their instruments refretted in Glasgow, and if they'd have any recommendations as to which place (either the two mentioned above, or any other place) would get me the best results. Thanks! \", \"author\": \"SirChickenalot\", \"timestamp\": \"2025-08-28T13:17:29.758098\"}",
    "1n2dd0g": "{\"text\": \"Hi Audrey, speaking as one of your constituents, you can fuck right off [https://news.stv.tv/politics/former-scottish-labour-councillor-who-quit-following-race-row-joins-reform](https://news.stv.tv/politics/former-scottish-labour-councillor-who-quit-following-race-row-joins-reform)\", \"author\": \"Osella28\", \"timestamp\": \"2025-08-28T14:16:46.588238\"}",
    "1n2dj5u": "{\"text\": \"Parking west end Ill be starting in glasgow uni soon, is there anywhere at all around the west end with free parking around 20min walk from james mccune smith hub?\", \"author\": \"Particular_Yak_5436\", \"timestamp\": \"2025-08-28T14:42:46.755299\"}",
    "1n2efqj": "{\"text\": \"How is Best Kebab still open? It's been around since before I was born and I went there a few times when I was in college 2017-2019 and I'd give it a 3/10 but that's being nice and I haven't been there since and from what I've heard I'm not missing much because everyone else says it's terrible, it's also empty every time I walk by. How is it still open if no one likes it?\\n\\n  \\nAlso I gave the place a chance so if the owner who bans everyone who criticises the place is reading this just know that I gave you a fair shot and I tried to be nice so this isn't me having a go at you because I gave you at least 3 chances by my estimate.\", \"author\": \"Jack-mclaughlin89\", \"timestamp\": \"2025-08-28T15:17:19.082693\"}",
    "1n2fml8": "{\"text\": \"Cafe business plans Does anyone opening a cafe in Southside(Victoria Road/Queen's Park area) ever do a business plan before opening up? \\n\\nThere's a place opening up soon that's posted on social media today asking what hours they should be open...I applaud the customer research attempt but surely this would be in the business plan? \\n\\nI know nothing about this - so happy to be educated on it. But it seems to be a cycle of;\\n\\nHome based business makes good product and get popular, makes money.\\n\\nThey decide to open a cafe location.\\n\\nIt's popular for the first little while as a novelty. But they underestimate the costs of running a fully staffed customer experience and don't account for people buying one coffee and sitting for hours at a time. \\n\\nPeople realise they can't afford to go every week/month and it's really only a special occasion visit at most. People associate the brand as a premium product. \\n\\nCafe decides to alter opening hours from a 10-3 to 7-2 in a bid to attract customers.\\n\\nInevitably shuts - going back to a customer less venue and another very similar business opens in its place.\", \"author\": \"glasgowburner\", \"timestamp\": \"2025-08-28T15:40:05.292632\"}",
    "1n2feuc": "{\"text\": \"Bus Lane Charge - challenge it? Got notice of a bus lane charge, seems I moved into the bus lane just before it ended and they of course have a camera there. In the picture it doesn\\u2019t look like all 4 wheels are fully in the lane. What\\u2019s the script with challenging something like that? Is there a law about how long you need to be in the lane? Or how much of your car? Double checked on Google maps and it was right at the end of the lane. Cheers. \", \"author\": \"Ecstatic-Cup-1356\", \"timestamp\": \"2025-08-28T15:40:05.419923\"}",
    "1n2fwr0": "{\"text\": \"Heighten police presence in central. What's with the level of police in central. Asked one of the officers who was decked out in his police uniform who pointed me towards a sign that states \\\"plain clothes officers are in this area\\\" \\n\\nRight that's sound but why's there like 15 officers dressed in their every day attire. Maybe see one or two normally. \", \"author\": \"EpexSpex\", \"timestamp\": \"2025-08-28T15:50:11.743079\"}",
    "1n2g5gy": "{\"text\": \"Is it possible to still pay in cash? I\\u2019m an incoming international student to university of Glasgow for this September. I\\u2019m thinking of bringing cash enough for around 3 months before I can open a bank account here. Is cash still acceptable in the majority of places or are they mostly cashless now? \", \"author\": \"aaaaa_san\", \"timestamp\": \"2025-08-28T16:21:09.609688\"}",
    "1n2h4fy": "{\"text\": \"Boteco on Argyle St. Bar on Argyle Street offering people unpaid trial shifts, which let\\u2019s be honest, is them taking advantage of free labour & never following up on offering the job. Avoid at all costs \", \"author\": \"Flaky-Caterpillar306\", \"timestamp\": \"2025-08-28T16:45:28.008571\"}",
    "1n2hnt7": "{\"text\": \"I don't know what to do. I booked a ticket online a week ago for Colorful Stage! The Movie: A Miku Who Can't Sing on showcase cinema coatbridge, I recently checked their website and suddenly the screen number changed from 1 to 12. Will the QR code i received before the change still work or would I have to contact showcase?\", \"author\": \"raymond-is-overrated\", \"timestamp\": \"2025-08-28T17:14:13.624884\"}",
    "1n2jv1y": "{\"text\": \"FREE TICKET TO FATHER JOHN MISTY TONIGHT BARROWLANDS Dm me and I'll transfer it to you via ticketmaster, I'll be there drinking if you want company, if not, it's all good. \", \"author\": \"ThisIsFitz\", \"timestamp\": \"2025-08-28T18:23:24.100050\"}",
    "1n2jr1j": "{\"text\": \"Anti-Vaxer stall in Argyle Street. On the corner of Argyle Street, as if you are turning towards Saint Enochs, you'll find a stall hosted by greesy pricks spreading propaganda that says Covid was a hoax and vaccines kill. \\n\\nHas anyone trolled them yet? Fuck antivaxers.\", \"author\": \"SpotTheReallyBigCat\", \"timestamp\": \"2025-08-28T18:23:24.170641\"}",
    "1n2jq7p": "{\"text\": \"Best Macaroni Pie? An English colleague mentioned they tried a macaroni pie last time in Glasgow. I want to bring them the best Glasgow has to offer. What baker does the best macaroni pie, the more hipster the better if there is such a thing out there. \", \"author\": \"NomisKeem\", \"timestamp\": \"2025-08-28T18:23:24.248060\"}",
    "1n2jjc6": "{\"text\": \"M8 incident today Was coming home today (towards Glasgow) and noticed the M8 eastbound was completely devoid of traffic. The only vehicles somewhere near Shotts were a police car, truck and car with hazards on cold shoulder. Further along realised all traffic was being diverted away from the M8. The news says that a man was found injured on the motorway? Anyone have anymore info on this? Never heard anything like it!\", \"author\": \"whatsername200\", \"timestamp\": \"2025-08-28T18:23:24.324596\"}",
    "1n2j6n2": "{\"text\": \"Looking for affordable hygienist in Glasgow (budget \\u00a360) Hi everyone,\\n\\nI\\u2019m looking for a dental hygienist in the East End of Glasgow (but happy to travel a bit further if needed). I just want a good clean/scale & polish. My budget is around \\u00a360.\\n\\nDoes anyone have any recommendations or places they\\u2019ve had a good experience with?\\n\\n\", \"author\": \"Working-Basis6611\", \"timestamp\": \"2025-08-28T18:23:24.405775\"}",
    "1n2oxpk": "{\"text\": \"Best places to eat Hey! I'm visiting Glasgow from Spain with my friends to celebrate that we've graduated from uni. We're looking to try some of the food here, specially fish&chips and the english breakfast. What are the best chippies? Where can we get the best english breakfast? And any other recommendations for restaurants that we shouldn't miss?\\n\\nThank you all! :)\", \"author\": \"Pepis_77\", \"timestamp\": \"2025-08-28T21:40:27.351307\"}",
    "1n2pf5c": "{\"text\": \"Ipod Repair Shop/Battery Replacement Anyone have any recommendations for a good iPod repair shop or battery replacement shop near the West End? I have an older iPod Touch 6th generation that has a battery that is starting to go, along with the Bluetooth. The iPod itself works well, I was hoping to swap the battery out myself like with an iPhone, but the older iPods are unfortunately a bit tricker, and I don't have access to a soldering iron... Anyone know a place?\", \"author\": \"HigginDazs\", \"timestamp\": \"2025-08-28T22:15:20.926574\"}",
    "1n2e2bh": "{\"text\": \"Good cocktails Does anyone know where you can get a decent value pinacolada in Glasgow? Find it's either premixed nonsense or overpriced Instagram. All looks no flavour. Any info appreciated \\u263a\\ufe0f fyi I don't mind paying for a good cocktail. Appreciate value over price.\", \"author\": \"Agile-Calligrapher10\", \"timestamp\": \"2025-08-28T22:49:28.818956\"}",
    "1n2r3zq": "{\"text\": \"M8 roadworks extended for another 2 years \", \"author\": \"trickstyle48\", \"timestamp\": \"2025-08-28T23:15:14.362600\"}",
    "1n2u0gl": "{\"text\": \"Anyone hiring (it\\u2019s urgent) Can I know if anyone\\u2019s currently hiring in Glasgow area? And don\\u2019t tell me indeed or any online places I genuinely need somewhere that will get me a work ehich has training as well if needed. I don\\u2019t wanna sound like a dick for making it reslly short and sound arrogant, but I genuinely need a job so I can pay off some things. Part time since I go college, but if anyone knows anything please let me know I\\u2019m in some desperately need. I know the job market is so ass but if anyone can help out, I genuinely owe you so please. Thank you.\", \"author\": \"Regular_Interest_456\", \"timestamp\": \"2025-08-29T01:15:43.302141\"}",
    "1n2gr1e": "{\"text\": \"Book launch \", \"author\": \"Ellis_Grayson25\", \"timestamp\": \"2025-08-29T02:46:57.036071\"}",
    "1n2yi3q": "{\"text\": \"The Steamie - Friday 29 August 2025 **Travel**\\n\\nNo line problems reported.\\n\\n**Today in Scottish History**\\n\\n29 August 1930: The remote Island of St Kilda, lying in the Atlantic to the west of the Western Isles, is evacuated.\\n\\n**/r/GlasgowMarket Digest**\\n\\n[Book launch](/r/glasgowmarket/comments/1n2gr1e/book_launch/)\\n\\n[Sofia Isella Glasgow (28/08/25)](/r/glasgowmarket/comments/1n1brft/sofia_isella_glasgow_280825/)\\n\\n[Chappel roan](/r/glasgowmarket/comments/1n0l38g/chappel_roan/)\\n\\n[Ticket for King Tut's Summer Nights on the 29th](/r/glasgowmarket/comments/1n0i2fr/ticket_for_king_tuts_summer_nights_on_the_29th/)\\n\\n[Stride Athletics Urban Orienteering - Wednesday 27 August](/r/glasgowmarket/comments/1mz67vt/stride_athletics_urban_orienteering_wednesday_27/)\\n\\n[Books for sale](/r/glasgowmarket/comments/1myqtdz/books_for_sale/)\\n\\n[Anyone selling 2-3 esdee kid tickets for the 19th, can pay abit above also must provide legit proof of the tickets!](/r/glasgowmarket/comments/1mxbj1u/anyone_selling_23_esdee_kid_tickets_for_the_19th/)\\n\\n**Tune of the day**\\n\\n[Paula Seling & Ovi - Playing With Fire (Romania) Live 2010 Eurovision Song Contest](https://youtu.be/J9EtMZXeQZw) (suggested by /u/Queasy-Ice-2575) \\n\\nPicked from 2 eligible links submitted today. [Suggest tomorrow's tune](https://www.reddit.com/message/compose/?to=SteamieBot&subject=SongRequest&message=YouTube link here).\", \"author\": \"SteamieBot\", \"timestamp\": \"2025-08-29T05:15:52.004210\"}",
    "1n343o5": "{\"text\": \"Sand Dug Guy I\\u2019m pitched up next to Sand Dug Guy the day if anybody wants to send him some well wishes.\", \"author\": \"RayGLA\", \"timestamp\": \"2025-08-29T10:50:52.776652\"}",
    "1n343mv": "{\"text\": \"Tomorrow in Falkirk: Far Right groups plan to march on Cladhan Hotel, a repeat after nearly 1000 turned up on recent gathering \\u26a0\\ufe0f *EMERGENCY FALKIRK MOBILISATION TOMORROW*\\n\\nStand Up to Racism the Scottish Trade Union Congress are calling an emergency mobilisation to defend refugees at the Cladhan Hotel and support Falkirk anti-racists and trade unionists. The far-right intend to march on the hotel. Please spread the word far and wide and take action now to organise delegations from your area now.\", \"author\": \"Organic_Structure473\", \"timestamp\": \"2025-08-29T10:50:52.861951\"}",
    "1n34asp": "{\"text\": \"Fitness & creative groups in Glasgow \\u2013 looking for recommendations Hi everyone,\\n\\nI\\u2019m 28M, new to Glasgow (been here a few weeks) and really enjoying it so far! I\\u2019m just trying to get more settled in and meet people through activities. I'm in the Dennistoun area. \\n\\nA few things I\\u2019ve been looking for but not had much luck finding yet:\\n\\n* Hip-hop dance classes/groups\\n* Any football teams that are recruiting at the moment\\n* Hiking groups \\n* Ceramics (especially wheel throwing) with studios that have regular open sessions\\n* Music production\\n\\nI\\u2019ve searched the sub and tried Meetup, but nothing has quite clicked yet. If anyone has recommendations or knows of groups/classes, I\\u2019d massively appreciate it. Any other recommendations are welcome too.  \\n\\nThanks in advance as I know the list of things is quite random! \", \"author\": \"NBXT4\", \"timestamp\": \"2025-08-29T11:13:40.702720\"}",
    "1n34weh": "{\"text\": \"Help identify building I\\u2019ve not long moved house and have a wonderful view of Glasgow/Renfrewshire from my new house on top of a large hill. I\\u2019m curious if anyone can help me figure out what this building is that I\\u2019ve circled with the \\u2018?\\u2019 I can\\u2019t for the life of me figure it out!\", \"author\": \"ThatFruityGuy\", \"timestamp\": \"2025-08-29T11:38:46.777023\"}",
    "1n35ay8": "{\"text\": \"\\ud83d\\udea8Scottish participants wanted for a paid eye-tracking experiment! \\ud83d\\udea8 (Glasgow) https://preview.redd.it/zu19ci846ylf1.png?width=2448&format=png&auto=webp&s=b09c5e27e8979f819efd1e8304f778c0d552db17\\n\\nWe are starting our recruitment drive again for after summer with our eye-tracking experiment. Please take a look at see if you'd be interested!\\n\\nWe are researchers at the University of Glasgow, and we are looking at whether watching media can affect how we understand and process the meaning of language.\\n\\nThe experiment will take place on-campus, and to take part you must be Scottish and between the ages of 18 and 45.\\n\\nTake a look at the poster for more information. If you would like to take part, please click on the link here: [https://uofg.qualtrics.com/jfe/form/SV\\\\_aXmPfuN4bErfiu2](https://uofg.qualtrics.com/jfe/form/SV_aXmPfuN4bErfiu2)\", \"author\": \"smash_avocado\", \"timestamp\": \"2025-08-29T12:33:39.326030\"}",
    "1n39wib": "{\"text\": \"New plan to bring 'rapid improvements' to Glasgow city centre \", \"author\": \"CommonConflict9519\", \"timestamp\": \"2025-08-29T15:14:35.317814\"}",
    "1n3camv": "{\"text\": \"Lens wipes Hi, \\nDoes anyone know somewhere that sells lens wipes (for glasses etc)? I've tried Sainsbury's, Morrison's and Boot's, but none of them have them in stock. Normally I buy them online, but I thought I'd try to shop on the high street. \\nI'm in Partick, if that helps you suggest somewhere:)\", \"author\": \"AsleepCaramel2952\", \"timestamp\": \"2025-08-29T16:45:02.997848\"}",
    "1n32fgn": "{\"text\": \"Antler carving? Longshot but im wandering if anyone knows of some craftsperson in the Glasgow/Edinburgh area that uses antlers?\\n\\nI got lucky and found a couple on a camping trip, thought it'd be cool to get them turned into handles for the guys I went on the trip with\", \"author\": \"DuckBelladonna\", \"timestamp\": \"2025-08-29T16:45:03.293120\"}",
    "1n3csbg": "{\"text\": \"Diverse private accom / student accomm recommendations please! So personally I (F25) prefer shared ensuite/flat situations (ie where bathroom and bedroom is private, kitchen, dining and living space are shared usually between 4-6 individuals). I\\u2019m not sure if it\\u2019s just my luck but so far I\\u2019ve been only getting put into flats where the majority is a single race. My issue is not the race itself, but it sucks how I\\u2019m the only one who\\u2019s different and it\\u2019s really really hard to break into a friend group, and I\\u2019m someone who\\u2019s quite outgoing. I booked a studio once too, (I\\u2019ve been in 3 student accommodations so far), as flats have been even more depressing when by right I should\\u2019ve been friends and I wasn\\u2019t able too, and I tried to talk up to people in the communal space and the gym within the student accom and have no way to make friends.\\n\\nTLDR:\\nHence please feel free to recommend your suggestions for either private or student accommodations that have atleast a little bit of diversity, either through different cultures or nationalities. Thank you!\", \"author\": \"HerGlasRoots\", \"timestamp\": \"2025-08-29T16:55:30.147140\"}",
    "1n3d6j3": "{\"text\": \"Jiu Jitsu Near East Kilbride Hi all,\\n\\nI am looking for recommendations for Brazilian jiu Jitsu gyms in the East Kilbride/Surrounding area?\\n\\nThank you very much!\", \"author\": \"AjerDB\", \"timestamp\": \"2025-08-29T17:14:52.932904\"}",
    "1n3d0u0": "{\"text\": \"Help with picking a hotel (preferably using points) for first time in Glasgow I'm looking for some help on where to stay in Glasgow. We'll get in on a Saturday afternoon and leave Monday morning (to go to Isle of Skye). It's our first time there, and we will want to be able to see the main tourist attractions, and walk around areas where there are lots of restaurants, pubs, etc. The West End area looks great and I think we'd probably end up spending a lot of time there, but I'm hoping to use points to book the hotel, and there are none in that area.  We can stay at the Voco grand central on points- would this be a bad area to stay? It seems like we can get on the subway nearby to go to the west end, but I don't know if I want to stay at this hotel if we wouldn't be spending any time in this area. Thoughts?\", \"author\": \"SSdogmama\", \"timestamp\": \"2025-08-29T17:14:53.064406\"}",
    "1n3ee8j": "{\"text\": \"Hayseed heading to Glasgow. Looking for where to overnight park beside \\u00d2ran M\\u00f3r. Paid, Unpaid. Do not know how it works.\\n\\nThanks\", \"author\": \"ruairidhmacdhaibhidh\", \"timestamp\": \"2025-08-29T18:22:00.878586\"}",
    "1n3fx9k": "{\"text\": \"Seen the polis \", \"author\": \"bindwardi\", \"timestamp\": \"2025-08-29T19:12:33.487365\"}",
    "1n3j2df": "{\"text\": \"Good lunch options near Anniesland college? Just started attending anniesland college and have spent this week living off 1.60 roll and fritters from the nearby chip shop (not complaining, they are pretty good), but would like to find lunch thats cheaper and not unhealthy. Anyone in the area got good suggestions? \", \"author\": \"SpotTheReallyBigCat\", \"timestamp\": \"2025-08-29T21:14:22.156586\"}",
    "1n3iyf8": "{\"text\": \"Today on GWR \", \"author\": \"mtcerio\", \"timestamp\": \"2025-08-29T21:14:22.231611\"}",
    "1n3jgsa": "{\"text\": \"Fratellis Looking for 1 or 2 tix for the fratellis on 27th feb \\ud83d\\ude4f\\ud83c\\udffc\", \"author\": \"AntiqueCrocs1903\", \"timestamp\": \"2025-08-29T21:28:24.380319\"}",
    "1n3k1g5": "{\"text\": \"22 year old and wanting to sit a Higher as an external candidate (no classroom learning, self taught) I have a university degree in a completely unrelated subject and work in excess of 30 hours a week. I fancied taking a Higher in a subject of interest.\\n\\nAre there any colleges or schools that would allow me to take the exam but not be in a classroom or lecture hall? I could teach myself the content and pay to take an exam.\", \"author\": \"Own-Syllabub-4848\", \"timestamp\": \"2025-08-29T21:38:56.946142\"}",
    "1n3knll": "{\"text\": \"Not quite south side But another one bites the dust , Valaria in Byres Rd. Remember seeing the queue when it opened and the self declared influencer types doing the whole filming themselves walking in, getting in everyone's way as they hadn't worked out how to balance the queue for the counter from the siting peeps. Nice bread, though, and the cookies were great.\", \"author\": \"WolverineOk4248\", \"timestamp\": \"2025-08-29T22:15:07.316430\"}",
    "1n3l62t": "{\"text\": \"High pitched ringing in Yoker/Renfrew Is anyone else in the Garscadden area or across the river in Renfrew hearing that loud high pitched ringing, or know anyone who is? Constant, day and night for the last 3-4 days ish. I\\u2019m at my wits end with it. Thinking it\\u2019s from that big boat on the Clyde right by here?\\n\\nTook a video of it for my friend who also heard it too so I\\u2019m not losing the plot\\u2026 right? :\\u2019) \", \"author\": \"daisybug224\", \"timestamp\": \"2025-08-29T22:32:14.811500\"}",
    "1n3ncsr": "{\"text\": \"Forgot trench coat on the train \", \"author\": \"veryredvelour\", \"timestamp\": \"2025-08-30T01:12:18.698953\"}"
  },
  "last_updated": "2025-08-30T04:49:38.695993",
  "total_posts": 264
}